{

    "profiles": [
   {
      "id":"0",
      "name":"Ada Lovelace",
      "details":"Augusta Ada King, Countess of Lovelace, born Augusta Ada Byron and now commonly known as Ada Lovelace, was an English mathematician and writer chiefly known for her work on Charles Babbage's early mechanical general-purpose computer, the Analytical Engine. Her notes on the engine include what is recognized as the first algorithm intended to be carried out by a machine. Because of this, she is often described as the world's first computer programmer.",
      "website":"http://en.wikipedia.org/wiki/Ada_Lovelace",
      "image_path":"/img/profile/220px-Ada_Lovelace_portrait.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Ada_Lovelace",
      "birth_year":"1815",
      "death_year":"1852",
      "given_name":"Ada",
      "surname":"Lovelace"
   },
   {
      "id":"1",
      "name":"Adele Goldberg",
      "details":"Adele Goldberg is a computer scientist who participated in the development of the programming language Smalltalk-80 and various concepts related to object-oriented programming while a researcher at the Xerox Palo Alto Research Center, PARC, in the 1970s. Goldberg began working at PARC in 1973 as a laboratory and research assistant, and eventually became manager of the System Concepts Laboratory where she, Alan Kay, and others developed Smalltalk-80, which both developed the object-oriented approach of Simula 67 and introduced a programming environment of overlapping windows on graphic display screens. Not only was Smalltalk's innovative format simpler to use, it was also customizable and objects could be transferred among applications with minimal effort. Goldberg and Kay also were involved in the development of design templates, forerunners of the design patterns commonly used in software design.",
      "website":"http://en.wikipedia.org/wiki/Adele_Goldberg_(computer_scientist)",
      "image_path":"/img/profile/adele_goldberg.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Adele_Goldberg_(computer_scientist)",
      "birth_year":"1945",
      "given_name":"Adele",
      "surname":"Goldberg",
      "known_for":"Smalltalk",
      "alma_mater":"University of Michigan; University of Chicago"
   },
   {
      "id":"2",
      "name":"Anita Borg",
      "details":"Anita Borg was an American computer scientist. She founded the Institute for Women and Technology (now the Anita Borg Institute for Women and Technology) and the Grace Hopper Celebration of Women in Computing. She was born Anita Borg Naffz in Chicago, Illinois. She grew up in Palatine, Illinois; Kaneohe, Hawaii; and Mukilteo, Washington. Borg got her first programming job in 1969. Although she loved math while growing up, she did not originally intend to go into computer science and taught herself to program while working at a small insurance company. She earned a doctorate in computer science from New York University in 1981. Her dissertation was on operating system synchronization efficiency.",
      "website":"http://en.wikipedia.org/wiki/Anita_Borg",
      "image_path":"/img/profile/220px-Anita_Borg.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Anita_Borg",
      "birth_year":"1949",
      "death_year":"2003",
      "given_name":"Anita",
      "surname":"Borg",
      "known_for":"Creator of Systers mailing list, founder of Grace Hopper Celebration of Women in Computing"
   },
   {
      "id":"3",
      "name":"Audrey Tang",
      "details":"Audrey Tang is a Taiwanese free software programmer, who has been described as one of the \"ten greats of Taiwanese computing.\" Tang showed an early interest in computers, beginning to learn Perl programming at age 12. Two years later, she dropped out of high school, unable to adapt to student life. By the year 2000, at the age of 19, Tang had already held positions in software companies, and worked in California's Silicon Valley as an entrepreneur. In late 2005, Tang began to transitioning her gender identity as a trans woman, including changing her English and Chinese names, citing a need to \"reconcile her outward appearance with her self-image\". Taiwan's Eastern Television reports that she has an IQ of 180.",
      "website":"http://en.wikipedia.org/wiki/Audrey_Tang",
      "image_path":"/img/profile/220px-AudreyTang060527.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Audrey_Tang",
      "birth_year":"1981",
      "given_name":"Audrey",
      "surname":"Tang"
   },
   {
      "id":"4",
      "name":"Éva Tardos",
      "details":"Éva Tardos is a Hungarian mathematician, winner of the Fulkerson Prize (1988) for her research on design and analysis of algorithms, and professor of Computer Science at Cornell University. Research is in algorithms and algorithmic game theory, the subarea of theoretical computer science theory of designing systems and algorithms for selfish users. My research focuses on algorithms and games on networks and simple auctions. I am mostly interested in designing algorithms and games that provide provably close-to-optimal results.",
      "website":"http://en.wikipedia.org/wiki/%C3%89va_Tardos",
      "image_path":"/img/profile/EvaT1.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Éva_Tardos",
      "birth_year":"1957",
      "given_name":"Eva",
      "surname":"Tardos",
      "alma_mater":"Eötvös Loránd University"
   },
   {
      "id":"5",
      "name":"Barbara Liskov",
      "details":"Barbara Liskov is a computer scientist who is an institute professor at the Massachusetts Institute of Technology and Ford Professor of Engineering in its School of Engineering's electrical engineering and computer science department. Barbara Liskov together with Jeannette Wing developed the Liskov substitution principle. Liskov was also the winner of the Turing Prize in 2008. Liskov earned her BA in mathematics at the University of California, Berkeley in 1961. In 1968 Stanford University made her one of the first women in the United States to be awarded a Ph.D. from a computer science department. The topic of her Ph.D. thesis was a computer program to play chess endgames.",
      "website":"http://en.wikipedia.org/wiki/Barbara_Liskov",
      "image_path":"/img/profile/barbara_liskov.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Barbara_Liskov",
      "given_name":"Barbara",
      "surname":"Liskov"
   },
   {
      "id":"6",
      "name":"Beatrice Helen Worsley",
      "details":"Beatrice \"Trixie\" Helen Worsley was the first female computer scientist in Canada. She received her Masters degree in mathematics from Massachusetts Institute of Technology in 1946 and her Ph.D. from Cambridge University. Early in 1949 she was sent to Cambridge University to gain experience on the EDSAC which was then nearing completion. The EDSAC was first demonstrated in May of that year and an account of the first demonstration including flow diagrams, programs and output - a table of primes from 5 to 1021 and a table of squares and first differences of the integers from 1 to 32 - may be found in (Worsley, 1949). When the Ferut was installed, she was one of the persons who wrote Transcode, a programming system which allowed programmers to write programs in a simplified language that was then compiled into Ferut's quite arcane machine language (Hume and Worsley, 1955). Trixie continued her studies at Cambridge and received a Ph.D. in 1952. She was possibly the first woman to obtain a doctorate in the field of computers. She continued at the University of Toronto for some years eventually becoming an Associate Professor.",
      "website":"http://en.wikipedia.org/wiki/Beatrice_Helen_Worsley",
      "image_path":"/img/profile/ferut_thumbnail.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Beatrice_Helen_Worsley",
      "birth_year":"1921",
      "death_year":"1972",
      "given_name":"Beatrice Helen",
      "surname":"Worsley",
      "known_for":"Pioneering, Canadian computer scientist",
      "alma_mater":"University of Toronto;Massachusetts Institute of Technology; Newnham College, Cambridge"
   },
   {
      "id":"7",
      "name":"Betty Holberton",
      "details":"Frances Elizabeth \"Betty\" Holberton was one of the six original programmers of ENIAC, the first general-purpose electronic digital computer. Holberton was born Frances Elizabeth Snyder in Philadelphia in 1917. On her first day of classes at the University of Pennsylvania, Holberton's math professor asked her if she wouldn't be better off at home raising children. During World War II while the men were fighting, the Army needed the women to compute ballistics trajectories. Holberton was hired by the Moore School of Engineering to work as a \"computor\", and was soon chosen to be one of the six women to program the ENIAC. Classified as \"subprofessionals\", Holberton, along with Kay McNulty, Marlyn Wescoff, Ruth Lichterman, Betty Jean Jennings, and Fran Bilas, programmed the ENIAC to perform calculations for ballistics trajectories electronically for the Ballistic Research Laboratory (BRL), US Army. Their work on ENIAC earned each of them a place in the Women in Technology International Hall of Fame. In the beginning, because the ENIAC was classified, the women were only allowed to work with blueprints and wiring diagrams in order to program it.",
      "website":"http://en.wikipedia.org/wiki/Betty_Holberton",
      "image_path":"/img/profile/Betty_Holberton.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Betty_Holberton",
      "birth_year":"1917",
      "death_year":"2001",
      "given_name":"Betty",
      "surname":"Holberton",
      "known_for":"ENIAC"
   },
   {
      "id":"8",
      "name":"Carla Meninsky",
      "details":"Carla Meninsky was a video game designer during the early years of the Atari 2600 video game console. Along with Carol Shaw (creator of 3-D Tic-Tac-Toe and River Raid), Meninsky was one of two female engineers at Atari to develop video game cartridges released in the early 1980s. Meninsky's Atari 2600 credits include the award-winning 1980 racing game Dodge 'Em (also sold as Dodger Cars by Sears) and 1981's Warlords, a port of Atari's 1980 coin-op of the same name. Meninsky also worked on the 2600 port of Star Raiders (originally designed by Doug Neubauer and released in 1979 for the Atari 8-bit family of computers) and an unreleased prototype of Tempest. Meninsky's mother was a programmer and Carla learned programming in high school, but she switched from mathematics to neuropsychology and brain modelling at Stanford University. Given her artistic bent, Meninsky was particularly interested in vision and eventually veered back toward programming and a lifelong dream of creating animation tools. She presented her animation idea to Atari and was hired, but in the fluid environment characteristic of an early start-up, her talents were soon put to video game programming.",
      "website":"http://en.wikipedia.org/wiki/Carla_Meninsky",
      "image_path":"/img/profile/post-4709-1133813646.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Carla_Meninsky",
      "given_name":"Carla",
      "surname":"Meninsky"
   },
   {
      "id":"9",
      "name":"Carol Shaw",
      "details":"Originally an Atari employee, Carol Shaw is said to be the first female video game designer (for her unreleased Polo game in 1978, and 3-D Tic-Tac-Toe game in 1979). Later she joined Activision, where she programmed her best-known game, River Raid. According to the manual of River Raid, she is also a “scholar in the field of Computer Science.” With Keith Brewster she worked on the Atari Basic Reference Manual.\nCarol Shaw left Activision in 1984 after designing Happy Trails for the Intellivision and River Raid for the Atari 800 and Atari 5200. Her other credits include Checkers in 1981 and 3-D Tic-Tac-Toe in 1980 for the Atari 2600. She also worked on Super Breakout. Shaw lives in California, and is now retired and married to Ralph Merkle, a researcher in nanotechnology. Born in 1955, Shaw was born and raised in Palo Alto, California. Her father was a mechanical engineer and worked at the Stanford Linear Accelerator Center. Shaw first became interested in computers in high school when she used a computer for the first time and discovered she could play text-based games on the system. Shaw attended UC Berkeley and graduated with a B.S. in Electrical Engineering and Computer Science in 1977. She went on to complete a master's degree in Computer Science at Berkeley.",
      "website":"http://en.wikipedia.org/wiki/Carol_Shaw_(video_game_designer)",
      "image_path":"/img/profile/carol_shaw.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Carol_Shaw_(video_game_designer)",
      "birth_year":"1955",
      "given_name":"Carol",
      "surname":"Shaw"
   },
   {
      "id":"10",
      "name":"Dame Stephanie",
      "details":"Dame Stephanie \"Steve\" Shirley, DBE, FREng, FRSA, FBCS (born 16 September 1933, Dortmund, Germany) is a British businesswoman and philanthropist. She originally arrived in Britain as an unaccompanied Kindertransport child refugee. She was placed with foster parents in Sutton Coldfield and was later re-united with her biological parents, but later claimed she \"never really bonded with them\". In 1962, Shirley founded the software company F.I. Group (later Xansa, since acquired by Steria). She was concerned with creating work opportunities for women with dependants, and predominantly employed women, only 3 out of 300-odd programmers were male, until the Sex Discrimination Act 1975 made that illegal. She adopted the name \"Steve\" to help her in the male-dominated business world.",
      "website":"http://en.wikipedia.org/wiki/Steve_Shirley",
      "image_path":"/img/profile/220px-Dame_steve_shirley.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Steve_Shirley",
      "birth_year":"1933",
      "given_name":"Steve",
      "surname":"Shirley",
      "known_for":"Philanthropy and founding the IT company, F.I. Group"
   },
   {
      "id":"11",
      "name":"Dana Ulery",
      "details":"Dr. Dana Ulery is an American computer scientist and pioneer in scientific computing applications. She began her career in 1961 as the first woman engineer at the NASA Jet Propulsion Laboratory (Pasadena, CA), designing and developing algorithms to model NASA’s Deep Space Network capabilities and automating real-time tracking systems for the Ranger and Mariner space missions using a North American Aviation Recomp II, 40-bit word size computer. Over the course of her career, she has held positions as an applied science and technology researcher and manager in industry, academia, and government. In 2007, she retired from her position as Chief Scientist of the Computational and Information Sciences Directorate at the United States Army Research Laboratory(ARL). Ulery was among the first group of female managers at the US Army Research Laboratory. In these positions, she was also appointed Chair of the US Army Materiel Command Knowledge Management Council, and in 2002 was awarded the Army Knowledge Award for Best Transformation Initiative.",
      "website":"http://en.wikipedia.org/wiki/Dana_Ulery",
      "image_path":"/img/profile/220px-Dana_Ulery.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Dana_Ulery",
      "birth_year":"1938",
      "given_name":"Dana",
      "surname":"Ulery",
      "alma_mater":"Grinnell College; University of Delaware"
   },
   {
      "id":"12",
      "name":"Donna Dubinsky",
      "details":"Donna Dubinsky is an American businesswoman who played an integral role in the development of personal digital assistants (PDAs) serving as CEO of Palm, Inc. and co-founding Handspring with Jeff Hawkins in 1995. She has gone on to co-found the brain research company Numenta in 2005, also with Hawkins, around whose ideas she has said she is happy to build her career. Fortune nominated her, together with Hawkins, to the Innovators Hall of Fame, while TIME named the pair as part of its Digital 50 in 1999 for their contribution to the development of the PDA. Dubinsky grew up in midwest Michigan, where her father worked as a scrap dealer. She later attended Yale University where, as a student in Jonathan Edwards College, she majored in history and earned her bachelor's degree in 1977. Dubinsky then worked for the Philadelphia National Bank for a while before obtaining an MBA from Harvard Business School in 1981. After graduating from Harvard Business School, she went to Apple Computer where she worked as a customer-support liaison. By 1985, she ran part of the company's distribution network. Discontent with the internal environment of the company led her to pursue work elsewhere. In 1986, Bill Campbell recruited her to a senior position in Claris, a software subsidiary of Apple. Dubinsky was responsible for international sales and marketing, and within four years, her group was responsible for 50% of Claris's sales. However, Dubinsky decided to leave in 1991, when Apple did not allow Claris to become an independent company.",
      "website":"http://en.wikipedia.org/wiki/Donna_Dubinsky",
      "image_path":"/img/profile/Donna_Dubinsky.PNG",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Donna_Dubinsky",
      "birth_year":"1955",
      "given_name":"Donna",
      "surname":"Dubinsky",
      "known_for":"CEO of Palm and Handspring and Numenta",
      "alma_mater":"Harvard Business School; Yale University"
   },
   {
      "id":"13",
      "name":"Edith Clarke",
      "details":"Edith Clarke was the first female electrical engineer and the first female professor of electrical engineering at the University of Texas at Austin. She specialized in electrical power system analysis and wrote Circuit Analysis of A-C Power Systems. Edith Clarke was born February 10, 1883, in Howard County, Maryland to John Ridgely Clarke and Susan Dorsey Owings, one of nine children. After being orphaned at age 12, she was raised by her older sister. She used her inheritance to study mathematics and astronomy at Vassar College, where she graduated in 1908. After college, Clarke taught mathematics and physics at a private school in San Francisco and at Marshall College. She then spent some time studying civil engineering at the University of Wisconsin–Madison, but left to become a \"computer\" at AT&T in 1912. She computed for George Campbell, who applied mathematical methods to the problems of long-distance electrical transmissions. While at AT&T, she studied electrical engineering at Columbia University by night. In 1918, Clarke enrolled at the Massachusetts Institute of Technology, and the following year she became the first woman to earn an M.S. in electrical engineering from MIT",
      "website":"http://en.wikipedia.org/wiki/Edith_Clarke",
      "image_path":"/img/profile/Edith_Clarke.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Edith_Clarke",
      "birth_year":"1883",
      "death_year":"1959",
      "given_name":"Edith",
      "surname":"Clarke",
      "alma_mater":"Massachusetts Institute of Technology; Vassar College"
   },
   {
      "id":"14",
      "name":"Elizabeth J. Feinler",
      "details":"Elizabeth Jocelyn \"Jake\" Feinler is an American information scientist. From 1972 until 1989 she was director of the Network Information Systems Center at the Stanford Research Institute (SRI International). Her group operated the Network Information Center (NIC) for the ARPANET as it evolved into the Defense Data Network (DDN) and the Internet. Feinler was born on March 2, 1931 in Wheeling, West Virginia, where she also grew up. She received an undergraduate degree from West Liberty State College, the first from her family to attend college. She was working toward a Ph.D. in biochemistry from Purdue University when she decided to earn some money by working for a year or two before starting on her thesis. Working at the Chemical Abstracts Service in Columbus, Ohio, she served as an assistant editor on a huge project to index the world's chemical compounds. There she became intrigued with the challenges of creating such large data compilations and never returned to biochemistry. Instead, in 1960, she came to California and joined the Information Research Department at the Stanford Research Institute (now SRI International) where she worked to develop the Handbook of Psychopharmacology and the Chemical Process Economics Handbook.",
      "website":"http://en.wikipedia.org/wiki/Elizabeth_J._Feinler",
      "image_path":"/img/profile/220px-ElizabethFeinler-2011.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Elizabeth_J._Feinler",
      "birth_year":"1931",
      "given_name":"Elizabeth Jocelyn",
      "surname":"Feinler",
      "known_for":"Creating and running the original ARPANET NIC at SRI",
      "alma_mater":"West Liberty University; Purdue University"
   },
   {
      "id":"15",
      "name":"Ellen Spertus",
      "details":"Ellen Spertus is a Professor of Computer Science at Mills College, Oakland, California, United States, and a senior research scientist at Google. Spertus grew up in Glencoe, Illinois, where she attended New Trier High School. At MIT she received a B.S. in Computer Science and Engineering (1990), a master's degree in Electrical Engineering and Computer Science (1992), and a Ph.D. in Electrical Engineering and Computer Science (1998). She spent several summers between terms working for Microsoft. Spertus has written articles treating both technical and social subjects, often combining the two. She was profiled in a 1993 New York Times article about \"women who might change the face of the computer industry\" and in a follow-up article in 2003. In 2001 she was named \"The Sexiest Geek Alive\". Since January 2009, Spertus has spent her time at Google working on App Inventor for Android, a block based development platform with a graphical user interface that lets developers and amateurs alike create applications for Android. In May 2011, O'Reilly Media published App Inventor, which Spertus co-authored with David Wolber, Hal Abelson, and Liz Looney.",
      "website":"http://en.wikipedia.org/wiki/Ellen_Spertus",
      "image_path":"/img/profile/photo.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Ellen_Spertus",
      "given_name":"Ellen",
      "surname":"Spertus",
      "known_for":"App Inventor for Android, leasing a General Motors EV1",
      "alma_mater":"Massachusetts Institute of Technology"
   },
   {
      "id":"16",
      "name":"Erna Schneider Hoover",
      "details":"Dr. Erna Schneider Hoover (born June 19, 1926) is an American mathematician notable for inventing a computerized telephone switching method which \"revolutionized modern communication\" according to several reports. It prevented system overloads by monitoring call center traffic and prioritizing tasks on phone switching systems to enable more robust service during peak calling times. At Bell Laboratories where she worked for over 32 years, Hoover was described as an important pioneer for women in the field of computer technology. She was awarded one of the first patents for computer software. She was elected as a member of the National Inventors Hall of Fame in 2008. Hoover was born on June 19, 1926 in Irvington, New Jersey. Her family lived in South Orange, New Jersey and her father was a dentist and her mother was a teacher. She had a younger brother who died from polio at the age of five. She loved swimming, sailing, canoeing, and was interested in science at an early age. According to one source, she read the biography of Marie Curie which suggested to her that she could succeed in a scientific field despite the prevailing ideas about gender roles at the time. Hoover attended Wellesley College where she studied classical and medieval philosophy and history. She graduated from Wellesley in 1948 with honors, earning a bachelors degree, and she was inducted into Phi Beta Kappa and was honored as a Durant Scholar. She received a Ph.D. degree from Yale University in philosophy and foundations of mathematics in 1951.",
      "website":"http://en.wikipedia.org/wiki/Erna_Schneider_Hoover",
      "image_path":"/img/profile/erna-schneider-hoover.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Erna_Schneider_Hoover",
      "birth_year":"1926",
      "given_name":"Erna Schneider",
      "surname":"Hoover",
      "known_for":"Computerized system;for phone traffic",
      "alma_mater":"Yale University; Wellesley College"
   },
   {
      "id":"17",
      "name":"Evelyn Boyd Granville",
      "details":"Evelyn Boyd Granville was one of the first African-American women to receive a Ph.D. in mathematics; she earned it in 1949 from Yale University. Evelyn Boyd was born in Washington, D.C.; her father worked odd jobs but separated from her mother when Boyd was young. Boyd and her older sister were raised by her mother and aunt, who both worked at the Bureau of Engraving and Printing. She was valedictorian at Dunbar High School, which at that time was a segregated but academically competitive school for black students in Washington. With financial support from her aunt and, later, a small partial scholarship from Phi Delta Kappa, Boyd entered Smith College in the fall of 1941. She majored in mathematics and physics, but also took a keen interest in astronomy. She was elected to Phi Beta Kappa and to Sigma Xi and graduated summa cum laude in 1945. Encouraged by a graduate scholarship from the Smith Student Aid Society of Smith College, she applied to graduate programs in mathematics and was accepted by both Yale University and the University of Michigan; she chose Yale because of the financial aid they offered. There she studied functional analysis under the supervision of Einar Hille, finishing her doctorate in 1949. Her dissertation was \"On Laguerre Series in the Complex Domain.\" In 1950, she took a teaching position at Fisk University, a college for black students in Nashville, Tennessee (more prestigious postings being unavailable to black women). Two of her students there, Vivienne Malone-Mayes and Etta Zuber Falconer, went on to earn doctorates in mathematics of their own. But by 1952 she left academia and returned to Washington with a position at the Diamond Ordnance Fuze Laboratories. After four years there she moved to IBM as a computer programmer; at IBM, she moved from Washington to New York City in 1957. She married the Reverend Gamaliel Mansfield Collins in 1960 and with him moved to Los Angeles, where she worked for the U.S. Space Technology Laboratories, then in 1962 the North American Aviation Space and Information Systems Division, and then IBM again. Forced to move because of a restructuring at IBM, she took a position at California State University, Los Angeles in 1967 as a full professor of mathematics. She married realtor Edward V. Granville in 1970. After retiring from CSULA in 1984 she taught at Texas College in Tyler, Texas for four years, and then in 1990 joined the faculty of the University of Texas at Tyler as the Sam A. Lindsey Professor of mathematics. There she developed elementary school math enrichment programs.",
      "website":"http://en.wikipedia.org/wiki/Evelyn_Boyd_Granville",
      "image_path":"/img/profile/granvilleevelyn-margemurray.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Evelyn_Boyd_Granville",
      "birth_year":"1924",
      "given_name":"Evelyn Boyd",
      "surname":"Granville"
   },
   {
      "id":"18",
      "name":"Frances Brazier",
      "details":"Frances Brazier professor of Computer Science at the Vrije Universiteit in Amsterdam is one of the founder of NLnet the first Internet service provider in the Netherlands.",
      "website":"http://www.tbm.tudelft.nl/index.php?id=30890",
      "image_path":"/img/profile/frances-brazier.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Frances",
      "surname":"Brazier"
   },
   {
      "id":"19",
      "name":"Frances E. Allen",
      "details":"Frances E. Allen became the first female IBM Fellow in 1989. In 2006 she became the first female recipient of the ACM's Turing Award. Fran Allen's work has had an enormous impact on compiler research and practice. Both alone and in joint work with John Cocke, she introduced many of the abstractions, algorithms, and implementations that laid the groundwork for automatic program optimization technology. Allen's 1966 paper, \"Program Optimization,\" laid the conceptual basis for systematic analysis and transformation of computer programs. ",
      "website":"http://en.wikipedia.org/wiki/Frances_E._Allen",
      "image_path":"/img/profile/frances_allen.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Frances_E._Allen",
      "birth_year":"1932",
      "given_name":"Frances E.",
      "surname":"Allen",
      "known_for":"Parallel computing;Compiler;Program optimization;Supercomputer",
      "alma_mater":"University at Albany, SUNY; University of Michigan"
   },
   {
      "id":"20",
      "name":"Frances Spence",
      "details":"Frances Spence was one of the original programmers for the ENIAC computer. She was born Frances Bilas in Philadelphia in 1922. She attended Temple University but then was awarded a scholarship to Chestnut Hill College. She majored in mathematics with a minor in physics and graduated in 1942. While there, she met Kathleen McNulty, who also later became an ENIAC programmer. Although one of the original programmers of the ENIAC, her role as well as the other woman contributors were downplayed, due to the stigma that woman didn't like technology. McNulty and Spence were hired by the Moore School of Engineering to compute ballistics trajectories. Both were selected to become part of the first group of programmers for the ENIAC, which was designed to perform the same calculations. In 1947, she married Homer Spence, an Army electrical engineer from the Aberdeen Proving Grounds who had been assigned to the ENIAC project and later became head of the Computer Research Branch. Shortly after that, she resigned to raise a family.",
      "website":"http://en.wikipedia.org/wiki/Frances_Spence",
      "image_path":"/img/profile/Frances_Spence.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Frances_Spence",
      "birth_year":"1922",
      "death_year":"2012",
      "given_name":"Frances",
      "surname":"Spence",
      "alma_mater":"Chestnut Hill College"
   },
   {
      "id":"21",
      "name":"Gertrude Blanch",
      "details":"Gertrude Blanch (ca. 1897 - 1996) was an American mathematician who did pioneering work in numerical analysis and computation. Blanch was born Gittel Kaimowitz in Kolno, Poland, arrived in the United States as a child, and attended public schools in New York City. She spent fourteen years as a clerk, saving money for school. She received a Bachelor's of Science in Mathematics, with a minor in Physics, from New York University in 1932. She received her Ph.D. from Cornell University in algebraic geometry in 1935. For a while she worked as a substitute teacher at Hunter College; then, in 1938, she began work on the Mathematical Tables Project of the WPA, for which she was \"Director of Mathematics\" and \"Manager of Computation.\" This entailed designing algorithms that were executed by teams of human computers under her direction. Many of these computers possessed only rudimentary mathematical skills, but the algorithms and error checking in the Mathematical Tables Project were sufficiently well designed that their output defined the standard for transcendental function solution for decades. This project later became the Computation Laboratory of the National Bureau of Standards. The Mathematical Tables Project became an independent organization following the termination of the WPA at the end of 1942. During World War II, it operated as a major computing computing office for the US government and did calculations for the Office for Scientific Research and Development, the Army, the Navy, the Manhattan Project and other institutions. Blanch led the group throughout the war.",
      "website":"http://en.wikipedia.org/wiki/Gertrude_Blanch",
      "image_path":"/img/profile/gertrude_blanch.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Gertrude_Blanch",
      "birth_year":"1897",
      "death_year":"1996",
      "given_name":"Gertude",
      "surname":"Blanch"
   },
   {
      "id":"22",
      "name":"Grace Hopper",
      "details":"Grace Murray Hopper was an American computer scientist and United States Navy rear admiral. A pioneer in the field, she was one of the first programmers of the Harvard Mark I computer, and invented the first compiler for a computer programming language. She popularized the idea of machine-independent programming languages, which led to the development of COBOL, one of the first modern programming languages. She is credited with popularizing the term \"debugging\" for fixing computer glitches (inspired by an actual moth removed from the computer). Owing to the breadth of her accomplishments and her naval rank, she is sometimes referred to as \"Amazing Grace\". The U.S. Navy destroyer USS Hopper (DDG-70) is named for her, as was the Cray XE6 \"Hopper\" supercomputer at NERSC.",
      "website":"http://en.wikipedia.org/wiki/Grace_Hopper",
      "image_path":"/img/profile/grace-hopper.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Grace_Hopper",
      "birth_year":"1906",
      "death_year":"1992",
      "given_name":"Grace",
      "surname":"Hopper"
   },
   {
      "id":"23",
      "name":"Grete Hermann",
      "details":"Grete (Henry-)Hermann was a German mathematician and philosopher noted for her work in mathematics, physics, philosophy and education. She is noted for her early philosophical work on the foundations of quantum mechanics, and is now known most of all for an early, but long-ignored refutation of a no-hidden-variable theorem by John von Neumann. The disputed theorem and the fact that Hermann's critique of this theorem remained nearly unknown for decades are considered to have had a strong influence on the development of quantum mechanics. Hermann studied mathematics at Göttingen under Emmy Noether, where she achieved her Ph.D. in 1926. Her doctoral thesis, \"Die Frage der endlich vielen Schritte in der Theorie der Polynomideale\" (in English \"The Question of Finitely Many Steps in Polynomial Ideal Theory\"), published in Mathematische Annalen, is the foundational paper for computer algebra. It first established the existence of algorithms (including complexity bounds) for many of the basic problems of abstract algebra, such as ideal membership for polynomial rings. Hermann's algorithm for primary decomposition is still in use now.",
      "website":"http://en.wikipedia.org/wiki/Grete_Hermann",
      "image_path":"/img/profile/Grete_Hermann.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Grete_Hermann",
      "birth_year":"1901",
      "death_year":"1984",
      "given_name":"Grete",
      "surname":"Hermann"
   },
   {
      "id":"24",
      "name":"Hedy Lamarr",
      "details":"Hedy Lamarr was an Austrian-born American actress and inventor. After an early film career in Germany, Lamarr moved to Hollywood at the initiation of MGM head, Louis B. Mayer, where she soon became a star during MGM's \"Golden Age.\" Max Reinhardt, who directed her in Berlin, called her the \"most beautiful woman in Europe,\" having \"strikingly dark exotic looks,\" a sentiment widely shared by her audiences and critics. She garnered a degree of fame and notoriety after starring in the Czech director Gustav Machatý's Ecstasy. Her most popular success was as the biblical temptress Delilah in Cecil B. DeMille's Samson and Delilah (1949). Lamarr was also notable as co-inventor, with composer George Antheil, of an early technique for spread spectrum communications and frequency hopping, which paved the way for today's wireless communications and which, upon its invention in 1941, was deemed so vital to national defense that government officials would not allow publication of its details. At the Electronic Frontier Foundation's Sixth Pioneer Awards in 1997, she and George Antheil were honoured with special awards for their \"trail-blazing development of a technology that has become a key component of wireless data systems.\"",
      "website":"http://en.wikipedia.org/wiki/Hedy_Lamarr",
      "image_path":"/img/profile/Hedy_Lamarr.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Hedy_Lamarr",
      "birth_year":"1914",
      "death_year":"2000",
      "given_name":"Hedy",
      "surname":"Lamarr"
   },
   {
      "id":"25",
      "name":"Henrietta Swan Leavitt",
      "details":"Henrietta Swan Leavitt joined the Harvard \"computers\" a group of women engaged in the production of astronomical data at Harvard. She was instrumental in discovery of the cepheid variable stars which are evidence for the expansion. of the universe, discovering the relation between the luminosity and the period of Cepheid variable stars. A graduate of Radcliffe College, Leavitt started working at the Harvard College Observatory as a \"computer\" in 1893, examining photographic plates in order to measure and catalog the brightness of stars. Though she received little recognition in her lifetime, it was her discovery that first allowed astronomers to measure the distance between the Earth and faraway galaxies. After Leavitt's death, Edwin Hubble used the luminosity-period relation for Cepheids to determine that the Milky Way is not the only galaxy in the observable universe, and that the universe is expanding (see Hubble's law).",
      "website":"http://en.wikipedia.org/wiki/Henrietta_Swan_Leavitt",
      "image_path":"/img/profile/185px-Leavitt_aavso.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Henrietta_Swan_Leavitt",
      "birth_year":"1868",
      "death_year":"1921",
      "given_name":"Henrietta Swan",
      "surname":"Leavitt",
      "known_for":"period-luminosity relationship of Cepheid stars",
      "alma_mater":"Radcliffe College;Oberlin College"
   },
   {
      "id":"26",
      "name":"Ida Rhodes",
      "details":"Ida Rhodes was a mathematician who became a member of the clique of influential women at the heart of early computer development in the United States. Ida Rhodes (birth name Hadassah Itzkowitz) was born in a Jewish village between Nemyriv and Tulchyn in the Ukraine. She came to the United States in 1913 and was studying mathematics at Cornell University only six years later. She received her BA in mathematics in February, 1923 and her MA in September of the same year, graduating Phi Beta Kappa. She later studied at Columbia University in 1930 and 1931.\nRhodes held numerous positions involving mathematical computations before she joined the Mathematical Tables Project in 1940, where she worked under Gertrude Blanch, whom she would later credit as her mentor. She was a pioneer in the analysis of systems of programming, and with Betty Holberton designed the C-10 programming language in the early 1950s for the UNIVAC I. She also designed the original computer used for the Social Security Administration. In 1949, the Department of Commerce awarded her an Gold Medal for \"significant pioneering leadership and outstanding contributions to the scientific progress of the Nation in the functional design and the application of electronic digital computing equipment.\" Though she retired in 1964, Rhodes continued to consult for the Applied Mathematics Division of the National Bureau of Standards until 1971. Her work became much more widely known after her retirement, as she took the occasion to travel around the globe, lecturing and maintaining international correspondence. In 1976, the Department of Commerce presented her with a further Certificate of Appreciation on the 25th Anniversary of UNIVAC I, and then at the 1981 Computer Conference cited her a third time as a \"UNIVAC I pioneer.\" She died in 1986. In an unusual case of an old specialized algorithm still in use, and still credited to the original developer, Rhodes was responsible for the \"Jewish Holiday\" algorithms used in calendar programs to this day.",
      "website":"http://en.wikipedia.org/wiki/Ida_Rhodes",
      "image_path":"/img/profile/rhodes-1.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Ida_Rhodes",
      "birth_year":"1900",
      "death_year":"1986",
      "given_name":"Ida",
      "surname":"Rhodes"
   },
   {
      "id":"27",
      "name":"Irene Greif",
      "details":"Irene Greif is an American computer scientist and a founder of the field of Computer-Supported Cooperative Work (CSCW). She was the first woman to earn a Ph.D. in computer science from the Massachusetts Institute of Technology. Greif's mother was an accountant, and a native of New York. Greif has at least one sibling, a sister. She attended Hunter College High School before earning her undergraduate and graduate degrees from MIT. In 1975, Greif became the first woman to earn a Ph.D. in computer science from MIT; in her dissertation of that year, she published the first operational actor model. She was a professor of computer science at the University of Washington before returning to MIT as a professor of electrical engineering and computer science (1977–87). In 1984, Greif and Paul Cashman coined the term \"Computer Supported Cooperative\" and the initials, CSCW, at an interdisciplinary workshop in Cambridge, Massachusetts. Preferring research over teaching, she left academia in 1987 to join Lotus, where she directed its Product Design Group, and created the Lotus Research group in 1992. After Lotus was acquired by IBM, she became an IBM Fellow and served as director of collaborative user experience in the company's Thomas J. Watson Research Center. Greif is a Fellow of the American Academy of Arts and Sciences (AAAS) and the Association for Computing Machinery (ACM); she is also a member of the National Academy of Engineering. Her awards include Women in Technology International Hall of Fame inductee (2000) and Women Entrepreneurs in Science and Technology Leadership Award (2008). Now living in Newton Centre, Massachusetts, Greif retired from IBM in 2013. She is married to Albert R. Meyer, the Hitachi America Professor of Computer Science at MIT. Greif, who is Jewish, has a son and daughter, as well as two step-children.",
      "website":"http://en.wikipedia.org/wiki/Irene_Greif",
      "image_path":"/img/profile/Irene_Greif.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Irene_Greif",
      "given_name":"Irene",
      "surname":"Greif"
   },
   {
      "id":"28",
      "name":"Irma Wyman",
      "details":"Irma M. Wyman was an early computer engineer and the first woman to become vice president of Honeywell, Inc. She was a systems thinking tutor and was the first female CIO of Honeywell. In 1945, Wyman received a Regents Scholarship and was accepted into the College of Engineering at the University of Michigan as one of seven female students. To supplement her scholarship, she worked as a switchboard operator and waitress. At the time, women in engineering programs received little encouragement and support. While her grades qualified her for membership in Tau Beta Pi, the engineering honor society, she received only a \"Women's Badge\", since the society did not admit women at the time. Wyman graduated with a Bachelor of Sciences/EM degree in 1949. While still a junior in college, Wyman worked on a missile guidance project at the Willow Run Research Center. To calculate trajectory, they used mechanical calculators. She visited a Navy research facility that was working on similar problems, and discovered they were using a prototype of a programmable computer that had been developed at Harvard University. She became interested in computers and later recalled that \"I became an enthusiastic pioneer in this new technology and it led to my life's career.\" After graduation, she joined a start-up company that was eventually acquired by Honeywell Information Systems. She moved to Minneapolis and began a long management career at Honeywell, eventually serving as Chief Information Officer. She became vice president of Honeywell Corporate Information Management (CIM) before retiring in 1990. Wyman then began a second career as archdeacon in the Minnesota Diocese of the Episcopal Church where she coached servant leadership, retiring again after ten years as Archdeacon of the Diocese of Minnesota. Wyman supported research and planning as a thought leader in futures studies. As an aside to this, she contended to an interviewer in 1979, that it's just as important to know when to ignore all the careful planning and seize an opportunity. Wyman endowed the Irma M. Wyman Scholarship at the University of Michigan's Center for the Education of Women to support women in engineering, computer science and related fields.",
      "website":"http://en.wikipedia.org/wiki/Irma_Wyman",
      "image_path":"/img/profile/070319_aWyman.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Irma_Wyman",
      "birth_year":"1928",
      "given_name":"Irma",
      "surname":"Wyman"
   },
   {
      "id":"29",
      "name":"Janese Swanson",
      "details":"Janese Swanson (born 1958) is an American inventor and software developer. Swanson co-developed the first of the Carmen Sandiego educational games, and founded the company Girl Tech, which creates products aimed at making technology more interesting for girls. She has developed award-winning curricula, electronic toys, and books that encourage girls to explore technology and inventions. Her toy inventions include the Snoop Stopper Keepsake Box, Me-Mail Message Center, Zap N’ Lock Journal, Yak Bak, and Swap-It Locket. Her publications include Tech Girl's Internet Adventures, Tech Girl's Activity Book, and Girlzine: A Magazine for the Global Girl. In the late 1980s, Swanson was hired by Brøderbund Software as a product manager, where she helped develop The Treehouse, The Playroom, and the Macintosh edition of the game Where in Time Is Carmen Sandiego?. She invented gadgets for her daughter, including a voice recording device that she hoped to install in Jackie's day care cubby and in her own office. I missed her so much that I used to call my home answering machine to hear her voice, and I thought this would let me talk to her during the day. In 1992 she left Brøderbund to develop a follow-on device that electronically altered a voice's pitch and modulation, which she licensed to Yes! Entertainment (which marketed it as the Yak Bak), and to Tiger Electronics for its Talkboy FX. In 1995 Swanson decided that she wanted to create toys aimed specifically at girls, and founded Girl Tech as an independent company with headquarters near her home in San Rafael, California. Products included the \"Friend Frame\" talking picture frame, the \"Keepsafe\" storage box with a remote-controlled lock, and a remote listening device called \"Bug 'Em\". Swanson claimed that her vision for the company did not match the expectations of existing toy distributors: \"For two years after I founded the company, toy store buyers would say, 'Can you make it pink?' 'Can't you make it for boys?' And I would say, 'No, this is what girls like to play with.'\" She later sold the company to Radica Games, now a division of Mattel, for $6 million. She has also licensed her technologies to Hasbro and Sega.",
      "website":"http://en.wikipedia.org/wiki/Janese_Swanson",
      "image_path":"/img/profile/janese-swanson.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Janese_Swanson",
      "birth_year":"1958",
      "given_name":"Janese",
      "surname":"Swanson",
      "alma_mater":"San Diego State University"
   },
   {
      "id":"30",
      "name":"Jean Bartik",
      "details":"Jean Bartik was one of the original programmers for the ENIAC computer. In 1945, the Army was recruiting math majors for the war effort; her faculty adviser noticed a job advertisement for an Army project in Philadelphia and suggested Bartik apply. She was hired by the University of Pennsylvania to work for Army Ordnance at Aberdeen Proving Ground to calculate ballistics trajectories by hand as a human \"computer.\" While working there, Bartik met her husband, William Bartik, who was an engineer working on a Pentagon project at the University of Pennsylvania. They married in 1946 and divorced in 1968. When the Electronic Numeric Integrator and Computer (ENIAC) was developed for the purpose of calculating these same trajectories, Bartik applied to become a part of the project and was eventually selected to be one of its first programmers. Bartik and the other five original programmers became extremely adept at running the ENIAC, after learning how the machine worked only by reviewing diagrams of the device and by talking to its engineers: there was no manual. Initially, they were not allowed to see the ENIAC at all since it was still classified and their clearance hadn't gone through, so they had to learn how to program the machine solely through schematic diagrams. Bartik later became part of a group charged with converting the ENIAC into a stored program computer: in the original implementation, ENIAC was programmed by setting dials and changing cable connections. After the end of the war, she went on to work with the ENIAC designers John Eckert and John Mauchly, and helped them develop the BINAC and UNIVAC I computers. Recalling her time working with Eckert and Mauchly, she described their close group of computer engineers as a \"technical Camelot.\" In 1951, the same year the UNIVAC was introduced, Bartik left the industry to raise her three children. ",
      "website":"http://en.wikipedia.org/wiki/Jean_Bartik",
      "image_path":"/img/profile/68065028_134808027444.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Jean_Bartik",
      "birth_year":"1924",
      "death_year":"2011",
      "given_name":"Jean",
      "surname":"Bartik",
      "alma_mater":"Northwest Missouri State University;University of Pennsylvania"
   },
   {
      "id":"31",
      "name":"Jean E. Sammet",
      "details":"Jean E. Sammet (born March 23, 1928 in New York City) is an American computer scientist who developed the FORMAC programming language in 1962. She received her B.A. in Mathematics from Mount Holyoke College in 1948 and her M.A. in Mathematics from University of Illinois at Urbana-Champaign in 1949. She received an honorary D.Sc. from Mount Holyoke College in 1978. Sammet was employed by Sperry Gyroscope from 1955 to 1958 where she supervised the first scientific programming group. From 1958 to 1961, she worked for Sylvania as a staff consultant for programming research and a member of the original COBOL group. She joined IBM in 1961 where she developed FORMAC, the first widely used computer language for symbolic manipulation of mathematical formulas. At IBM she researched the use of restricted English as a programming language and the use of natural language for mathematical programs. She was Programming Technology Planning Manager for the Federal Systems Division from 1968 to 1974, and was appointed Software Technology Manager in 1979. Sammet founded the ACM Special Interest Committee on Symbolic and Algebraic Manipulation (SICSAM) in 1965 and was Chair of the Special Interest Group on Programming Languages (SIGPLAN). She was the first female president of the ACM, from 1974 to 1976.",
      "website":"http://en.wikipedia.org/wiki/Jean_E._Sammet",
      "image_path":"/img/profile/jeansammet.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Jean_E._Sammet",
      "birth_year":"1928",
      "given_name":"Jean E.",
      "surname":"Sammet"
   },
   {
      "id":"32",
      "name":"Jeri Ellsworth",
      "details":"Jeri Ellsworth (born 1974) is an American entrepreneur and autodidact computer chip designer and inventor. Currently the president of Technical Illusions, she became known in 2004 for creating a complete Commodore 64 system on a chip within a joystick, called C64 Direct-to-TV. That \"computer in a joystick\" could run 30 video games from the early 1980s, and was a very popular Christmas gift, at peak selling over 70,000 units in a single day via the QVC shopping channel. Ellsworth currently lives in Seattle.",
      "website":"http://en.wikipedia.org/wiki/Jeri_Ellsworth",
      "image_path":"/img/profile/jeri-ellsworth.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Jeri_Ellsworth",
      "birth_year":"1974",
      "given_name":"Jeri",
      "surname":"Ellsworth",
      "known_for":"Entrepreneur and autodidact computer chip designer"
   },
   {
      "id":"33",
      "name":"Joan Margaret Winters",
      "details":"Joan Margaret Winters began working in Computer Services at Cornell University in 1970. She later became Coordinator for User Support, a position that included managing the office's consulting and educational functions. While at Cornell Winters also designed and implemented SPINDEX II applications for the Department of Manuscripts and University Archives. In 1980 Winters took a position as a scientific programmer in SLAC Computing Services at the Stanford Linear Accelerator Center.",
      "website":"http://special.lib.umn.edu/findaid/xml/cbi00022.xml",
      "image_path":"/img/profile/joan_winters.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Joan Margaret",
      "surname":"Winters"
   },
   {
      "id":"34",
      "name":"Joanna Rutkowska",
      "details":"Joanna Rutkowska is a Polish computer security researcher, primarily known for her research on low-level security and stealth malware. She became known after the Black Hat Briefings conference in Las Vegas in August 2006, where Rutkowska presented an attack against Vista kernel protection mechanism, and also a technique dubbed Blue Pill, that used hardware virtualization to move a running OS into a virtual machine. Subsequently she has been named one of Five Hackers who Put a Mark on 2006 by eWeek Magazine for her research on the topic. The original concept of Blue Pill was published by another researcher at IEEE Oakland on May 2006 under the name VMBR. Its effectiveness is a subject of a debate among some researchers.",
      "website":"http://en.wikipedia.org/wiki/Joanna_Rutkowska",
      "image_path":"/img/profile/200px-Joanna_Rutkowska.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Joanna_Rutkowska",
      "given_name":"Joanna",
      "surname":"Rutkowska",
      "known_for":"Rootkit; Qubes OS; Blue Pill (software)"
   },
   {
      "id":"35",
      "name":"Judith Estrin",
      "details":"Judith \"Judy\" L. Estrin is an Internet pioneer and American business executive. Former colleague Richard A. Karp credits Estrin as one of the key people in the development of Internet when they worked together with Vint Cerf on the initial TCP-project at Stanford.\nShe is now CEO of JLabs (formerly called Packet Design Management Company), a privately held company focused on furthering innovation in business, government and non-profit organizations. Estrin is the author of \"Closing the Innovation Gap: Reigniting the Spark of Creativity in a Global Economy\" (McGraw-Hill; Hardcover, September 2008), a general interest book that challenges national, academic and business leaders to work together to make USA competitive again. Estrin is a serial entrepreneur who co-founded eight technology companies. She was the CTO of Cisco Systems from 1998 to 2000. Estrin served on the boards of FedEx Corporation (1989-2010), Rockwell Automation and Sun Microsystems, as well as on the Board of Directors of the Walt Disney Company for fifteen years. She also serves on the advisory boards of Stanford’s School of Engineering and Bio-X interdisciplinary program, and is a member of the University of California President’s Science and Innovation Advisory Board. She also served on the America Compete's Innovation Advisory Board in 2011.",
      "website":"http://en.wikipedia.org/wiki/Judith_Estrin",
      "image_path":"/img/profile/judy-estrin.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Judith_Estrin",
      "birth_year":"1954",
      "given_name":"Judith",
      "surname":"Estrin"
   },
   {
      "id":"36",
      "name":"Juliana Rotich",
      "details":"Juliana is a Technologist, MIT Media Lab Director's Fellow, TED Senior Fellow and currently serves as Chair of World Economic Forum Global Agenda Council on Data Driven Development. Juliana is Executive Director of Ushahidi Inc, a non-profit tech company, born in Africa, which specializes in developing free and open source software for information collection, interactive mapping and data curation. Ushahidi builds tools for democratizing information, increasing transparency and lowering the barriers for individuals to share their stories. She leads a team that is expanding its global footprint and making crowdsourcing tools available and useful, and catalyzing entrepreneurial initiatives like iHub in Kenya.",
      "website":"http://julia.na/",
      "image_path":"/img/profile/170px-Juliana_Rotich_-_World_Economic_Forum_on_Africa_2012.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Juliana",
      "surname":"Rotich"
   },
   {
      "id":"37",
      "name":"Karen Spärck Jones",
      "details":"Karen Spärck Jones FBA (26 August 1935 – 4 April 2007) was a British computer scientist. She worked at the Cambridge Language Research Unit from the late 1950s, then at Cambridge's Computer Laboratory from 1974, and retired in 2002, holding the post of Professor of Computers and Information, which she was awarded in 1999. She continued to work in the Computer Laboratory until shortly before her death. Her main research interests, since the late 1950s, were natural language processing and information retrieval. One of her most important contributions was the concept of inverse document frequency (IDF) weighting in information retrieval, which she introduced in a 1972 paper. IDF is used in most search engines today, usually as part of the tf-idf weighting scheme.",
      "website":"http://en.wikipedia.org/wiki/Karen_Sp%C3%A4rck_Jones",
      "image_path":"/img/profile/karen-sparck-jones.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Karen_Spärck_Jones",
      "birth_year":"1935",
      "death_year":"2007",
      "given_name":"Karen",
      "surname":"Spärck Jones",
      "known_for":"work on information retrieval and natural language processing, in particular her probabilistic model of document and text retrieval"
   },
   {
      "id":"38",
      "name":"Kathleen Booth",
      "details":"Kathleen Booth (née Britten) is credited with writing the first assembly language and the design of the assembler and autocode (ARC and APE(X)C) for the first computer systems at Birkbeck College, University of London. Kathleen Booth worked at Birkbeck College from 1946–62. She traveled to the United States as Andrew Booth's research assistant in 1947, visiting with John von Neumann at Princeton. Upon returning to the UK, she co-authored \"General Considerations in the Design of an All Purpose Electronic Digital Computer,\" describing modifications to the original ARC redesign to the ARC2 using a von Neumann architecture. Part of her contribution was the ARC assembly language. She also built and maintained ARC components. Kathleen and Andrew Booth's team at Birkbeck were considered the smallest of the early British computer groups. From 1947 to 1953, they produced three machines: ARC (Automatic Relay Computer), SEC (Simple Electronic Computer), and APE(X)C (All-purpose Electronic (Rayon) Computer). This was considered a remarkable achievement due the size of the group and the limited funds at its disposal. Although APE(X)C eventually led to the HEC series manufactured by the British Tabulating Machine Company, the small scale of the Birkbeck group did not place it in the front rank of British computer activity. Booth regularly published papers concerning her work on the ARC and APE(X)C systems and co-wrote \"Automatic Digital Computers\" (1953) which illustrated the 'Planning and Coding' programming style. She co-founded the School of Computer Science and Information Systems in 1957, along with Andrew Booth and J.C. Jennings. In 1958, she taught a programming course. In 1958, Booth wrote a book describing how to program APE(X)C computers.",
      "website":"http://en.wikipedia.org/wiki/Kathleen_Booth",
      "image_path":"/img/profile/kathleen-booth.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Kathleen_Booth",
      "birth_year":"1922",
      "given_name":"Kathleen",
      "surname":"Booth"
   },
   {
      "id":"39",
      "name":"Kay McNulty",
      "details":"Kathleen \"Kay\" McNulty Mauchly Antonelli (12 February, 1921 – 20 April 2006) was one of the six original programmers of the ENIAC, the first general-purpose electronic digital computer. A week or two after graduating, she happened to see a US Civil Service ad in The Philadelphia Inquirer looking for women with degrees in mathematics. During World War II, the US Army was hiring women to calculate bullet and missile trajectories at The Ballistic Research Laboratory, which had been established at the Aberdeen Proving Ground in Aberdeen, Maryland, with staff from both the Aberdeen Proving Ground and the Moore School of Engineering at the University of Pennsylvania. She immediately called her two fellow math majors, Frances Bilas and Josephine Benson about the ad. Benson couldn't meet up with them, so Kathleen and Fran met in Philadelphia one morning in June 1942 for an interview in a building on South Broad Street (likely the Union League Building). One week later, they were both hired as human \"computers\" at a pay grade of SP-4, a subprofessional civil service grade. They were notified to report to work at the Moore School of Engineering. Their job was to compute ballistics trajectories used for artillery firing tables, mostly using mechanical desk calculators and extremely large sheets of columned paper. The pay was low, but both Kathleen and Fran were satisfied to have attained employment that used their educations (having had no prior employment experience) and that served the war effort.",
      "website":"http://en.wikipedia.org/wiki/Kathleen_Antonelli",
      "image_path":"/img/profile/KayMcNulty.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Kathleen_Antonelli",
      "birth_year":"1921",
      "death_year":"2006",
      "given_name":"Kathleen",
      "surname":"McNulty"
   },
   {
      "id":"40",
      "name":"Kimberly Bryant",
      "details":"Kimberly Bryant is the Founder and Executive Director of Black Girls CODE, a non-profit organization focused on introducing girls of color (ages 7-17) to the field of technology and computer programming with a concentration on entrepreneurial concepts. Ms. Bryant's has enjoyed a very successful professional career as a Biotechnology Engineer in a series of technical leadership roles for various Fortune 100 companies such as Genentech, Merck, and Pfizer. ",
      "website":"http://about.me/kimberlybryant",
      "image_path":"/img/profile/cropped_kimberly_bryant.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Kimberly",
      "surname":"Bryant"
   },
   {
      "id":"41",
      "name":"Limor Fried",
      "details":"Limor Fried is an American electrical engineer and owner of the electronics hobbyist company Adafruit Industries. She is influential in the open-source hardware community, having participated in the first Open Source Hardware Summit and the drafting of the Open Source Hardware definition, and is known for her moniker ladyada, an homage to Lady Ada Lovelace. Fried studied at MIT, earning a BS in Electrical Engineering and Computer Science (EECS) in 2003 and a Master of Engineering in EECS in 2005. For part of the qualification she created a project called Social Defense Mechanisms: Tools for Reclaiming Our Personal Space. Following the concept of critical design she prototyped: glasses that darken when a television is in view, and a low-power RF jammer that prevent cell phones operating in a user’s personal space. During the same year, of 2005, Fried founded New York-based Adafruit Industries. The company designs and resells open source electronic kits mainly for the hobbyist market. In 2010 the company had eight employees and shipped more than $3 million worth of product. In 2009, she was awarded the Pioneer Award by the Electronic Frontier Foundation for her participation in the open source hardware and software community. Fried was awarded the Most Influential Women in Technology award, in 2011, by Fast Company magazine, and became the first female engineer featured on the cover of Wired. In an interview with CNET, Fried said, \"If there's one thing I'd like to see from this, it would be for some kids to say to themselves \"I could do that\" and start the journey to becoming an engineer and entrepreneur.\" Limor was named \"Entrepreneur of the Year\" in 2012 by Entrepreneur, of the 15 finalists she was the only female.",
      "website":"http://en.wikipedia.org/wiki/Limor_Fried",
      "image_path":"/img/profile/220px-Limor_Fried_2010.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Limor_Fried",
      "given_name":"Limor",
      "surname":"Fried",
      "known_for":"Open-source movement"
   },
   {
      "id":"42",
      "name":"Lorinda Cherry",
      "details":"Lorinda Cherry is a computer programmer. She received her Masters in computer science from Stevens Institute of Technology in 1969. She joined Bell Labs in 1972 as an assembly language programmer, and worked there on the Unix operating system for several years. Cherry has worked on mathematical tools, such as bc, and co-authored Eqn with Brian Kernighan. Her work on libplot inspired the later GNU plotutils package. Her non-mathematical work included the dictionary for the Unix spell checker and the Bell Labs's Writer's Workbench (wwb). The Writer's Workbench was meant to help students learn to edit their work: My feeling about a lot of those tools is their value in education is as much pointing out to people who are learning to write that they have choices and make choices when they do it. They don’t think of a writing task as making choices per se. Once they get it on paper they think it’s cast in stone. So it makes them edit. Cherry also contributed to the Plan 9 operating system, cowrote \"Typing Documents on the UNIX System: Using the –ms and –mcs Macros with Troff\" with Mike Lesk for the Unix Tenth Edition Manual, and coded up the non-dictionary based spellchecker, typo, conceived by Bob Morris. Cherry raced rally cars as a hobby.",
      "website":"http://en.wikipedia.org/wiki/Lorinda_Cherry",
      "image_path":"/img/profile/lorinda-cherry.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Lorinda_Cherry",
      "given_name":"Lorinda",
      "surname":"Cherry"
   },
   {
      "id":"43",
      "name":"Lynn Conway",
      "details":"Conway was recruited by IBM Research in Yorktown Heights, New York in 1964, and was soon selected to join the architecture team designing an advanced supercomputer, working alongside John Cocke, Herbert Schorr, Ed Sussenguth, Fran Allen and other IBM researchers on the Advanced Computing Systems (ACS) project, inventing multiple-issue out-of-order dynamic instruction scheduling while working there. The Computer History Museum has stated that \"the ACS machines appears to have been the first superscalar design, a computer architectural paradigm widely exploited in modern high-performance microprocessors. Conway was recruited by IBM Research in Yorktown Heights, New York in 1964, and was soon selected to join the architecture team designing an advanced supercomputer, working alongside John Cocke, Herbert Schorr, Ed Sussenguth, Fran Allen and other IBM researchers on the Advanced Computing Systems (ACS) project, inventing multiple-issue out-of-order dynamic instruction scheduling while working there. The Computer History Museum has stated that \"the ACS machines appears to have been the first superscalar design, a computer architectural paradigm widely exploited in modern high-performance microprocessors. Upon completing her transition in 1968, Conway took a new name and identity, and restarted her career in \"stealth-mode\" as a contract programmer at Computer Applications, Inc. She went on to work at Memorex during 1969–1972 as a digital system designer and computer architect. Conway joined the University of Michigan in 1985 as professor of electrical engineering and computer science, and associate dean of engineering. There she worked on \"visual communications and control probing for basic system and user-interface concepts as applicable to hybridized internet/broadband-cable communications\". She retired from active teaching and research in 1998, as professor emerita at Michigan. In the fall of 2012, the IEEE published a special issue of the IEEE Solid-State Circuits Magazine devoted to Lynn Conway’s career, including a career memoir by Lynn and peer commentaries by Chuck House, former Director of Engineering at HP, Carlo Séquin, Professor of EECS at U.C. Berkeley, and Ken Shepard, Professor of Electrical Engineering and Biomedical Engineering at Columbia University.",
      "website":"http://en.wikipedia.org/wiki/Lynn_Conway",
      "image_path":"/img/profile/200px-Lynn_Conway_July_2006.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Lynn_Conway",
      "birth_year":"1938",
      "given_name":"Lynn",
      "surname":"Conway",
      "known_for":"Mead & Conway revolution;Transgender activism",
      "alma_mater":"Columbia University"
   },
   {
      "id":"44",
      "name":"Maria Klawe",
      "details":"Maria Margaret Klawe (pronounced claw-vay, born 1951) is a computer scientist and the fifth president of Harvey Mudd College (since July 1, 2006). Although born in Toronto in 1951, she became a naturalized U.S. citizen in 2009. She was previously Dean of the School of Engineering and Applied Science at Princeton University. Klawe was born in Toronto. She lived in Scotland from ages 4 to 12, and then returned to Canada, living with her family in Edmonton, Alberta. Klawe studied at the University of Alberta, dropped out to travel the world, and returned to earn her B.Sc. in 1973. She stayed at Alberta for her graduate studies, and in 1977 she earned her Ph.D. there in mathematics. She joined the mathematics faculty at Oakland University as an assistant professor in 1977 but only stayed for a year. She started a second Ph.D., in computer science, at the University of Toronto, but was offered a faculty position there before completing the degree. She spent eight years in the industry, serving at IBM Almaden Research Center, in San Jose, California, first as a research scientist, then as manager of the Discrete Mathematics Group and manager of the Mathematics and Related Computer Science Department. She and her husband Nick Pippenger then moved to the University of British Columbia, where she stayed for 15 years and served as head of the Department of Computer Science from 1988 to 1995, vice president of student and academic services from 1995 to 1998, and dean of science from 1998 to 2002. From UBC she moved to Princeton and then Harvey Mudd College. Previously a Canadian national, Klawe was among 5,996 persons who became citizens of the United States at a ceremony held at the Los Angeles Convention Center on Thursday, Jan 29, 2009. Later in 2009, she joined the board of directors of the Microsoft Corporation. In addition to her career as a scientist and academic, Klawe is well known for her water color painting. Klawe is an active volunteer and advocate for encouraging more women to enter STEM fields.\n",
      "website":"http://en.wikipedia.org/wiki/Maria_Klawe",
      "image_path":"/img/profile/Maria_Klawe.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Maria_Klawe",
      "birth_year":"1951",
      "given_name":"Maria",
      "surname":"Klawe",
      "alma_mater":"Bachelor of Science;Doctor of Philosophy;University of Alberta"
   },
   {
      "id":"45",
      "name":"Marissa Mayer",
      "details":"Marissa Ann Mayer is the current president and CEO of Yahoo!, a position she has held since July 2012. Previously, she was a long-time executive and key spokesperson for Google. She joined Google in 1999 as employee number 20 and was the company's first female engineer. She started out writing code and overseeing small teams of engineers, developing and designing Google’s search offerings. She became known for her attention to detail. She was soon promoted to product manager and later became Director of Consumer Web products. She oversaw the layout of Google's well-known, unadorned search homepage In 2005 she became Vice President of Search Products and User Experience. Mayer held key roles in Google Search, Google Images, Google News, Google Maps, Google Books, Google Product Search, Google Toolbar, iGoogle, and Gmail. On July 16, 2012, Mayer was appointed President and CEO of Yahoo!, effective the following day. She is also a member of the company's board of directors. In 2013, Mayer ranked 32 in the Forbes Magazine's List of The World's 100 Most Powerful Women. Also in 2013, Mayer became the first woman listed as number one on Fortune magazine's annual list of the top 40 business stars under 40 years old. In 2014, she was listed again as one of the 100 most influential women in the world. She was ranked at #18, behind Beyonce Knowles.",
      "website":"http://en.wikipedia.org/wiki/Marissa_Mayer",
      "image_path":"/img/profile/marissa-mayer.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Marissa_Mayer",
      "birth_year":"1975",
      "given_name":"Marissa",
      "surname":"Mayer",
      "alma_mater":"Stanford University"
   },
   {
      "id":"46",
      "name":"Marlyn Wescoff",
      "details":"Marlyn Meltzer was one of the six original programmers of ENIAC, the first general-purpose electronic digital computer. She was born Marlyn Wescoff and graduated from Temple University in 1942. She was hired by the Moore School of Engineering later that year to perform weather calculations, mainly because she knew how to operate an adding machine; in 1943, she was hired to perform calculations for ballistics trajectories. In 1945, she was selected to become one of the first group of ENIAC programmers. The other five ENIAC women were Kathleen McNulty, Betty Jennings, Betty Snyder, Frances Bilas und Ruth Teitelbaum. Although mentioned in Woman of the ENIAC, at the time, little recognition was attributed to the women working on the computer. She resigned from the team in 1947 to get married before ENIAC was relocated to the Aberdeen Proving Grounds. In 1997 she was inducted into the Women in Technology International Hall of Fame, along with the other original ENIAC programmers.",
      "website":"http://en.wikipedia.org/wiki/Marlyn_Meltzer",
      "image_path":"/img/profile/marlyn_wescoff.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Marlyn_Meltzer",
      "birth_year":"1922",
      "death_year":"2008",
      "given_name":"Marlyn",
      "surname":"Meltzer"
   },
   {
      "id":"47",
      "name":"Mary Allen Wilkes",
      "details":"Mary Allen Wilkes (born September 25, 1937 in Chicago, Illinois) is a former computer programmer and hardware engineer, most known for her work with the LINC computer. In 1975, she left computer science and became an attorney. She is a graduate of Wellesley College, class of 1959. Wilkes worked in the MIT Lincoln Laboratory from 1959 to 1963, where she worked with some early computers, like the IBM 709 and the TX-2. While there, she simulated the LINC, what would become the first minicomputer, on the TX-2. She designed the console and the first operating system for LINC and continued to design many operating systems for LINC, all named beginning with \"LAP\" up to the LAP6. She then authored the LAP6 Handbook and co-authored Programming with LINC with Wesley A. Clark. In 1965, she designed and used a computer in her home, and is usually considered to be the first home computer user. This claim is dependent on the definition of a \"home computer.\" In 1965, Wilkes left MIT and began working at the Computer Systems Laboratory at Washington University in St. Louis. In St. Louis, she designed the multiply macromodule. After working at Washington University, she left Computer Science and entered law school at Harvard University Law School. She became an attorney in 1975 and practiced in Cambridge, Massachusetts, until she retired.",
      "website":"http://en.wikipedia.org/wiki/Mary_Allen_Wilkes",
      "image_path":"/img/profile/mary-allen-wilkes.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Mary_Allen_Wilkes",
      "birth_year":"1937",
      "given_name":"Mary Allen",
      "surname":"Wilkes",
      "known_for":"Work with LINC computer",
      "alma_mater":"Wellesley College;Harvard Law School"
   },
   {
      "id":"48",
      "name":"Mary Lou Jepsen",
      "details":"Mary Lou Jepsen is Head of the Display Division at Google X. She is also founder and former CEO of Pixel Qi, a manufacturer of high performance, low-power, sunlight-readable screens for mobile devices. She was the co-founder and the first chief technology officer of One Laptop per Child (OLPC). She was named to the \"Time 100\", an annual list of the 100 most influential people in the world according to Time Magazine. In 2013 she was named one of the CNN 10: a list of top 10 thinkers in science and technology by CNN. Jepsen studied Studio Art and Electrical Engineering at Brown University. She received a Master of Science in Holography from the MIT Media Lab, and then returned to Brown to receive a Ph.D. in Optical Sciences. Her contributions have had worldwide adoption in head-mounted display, HDTV and projector products. Her PhD work combined rigorous theoretical coupled-wave analysis with lab work, in which she created large-scale, embossed surface-relief diffraction gratings with liquid crystal-filled grooves with high diffraction efficiency in un-polarized illumination. Jepsen has created some of the largest ambient displays ever. In Cologne, Germany she built a holographic replica of pre-existing buildings in the city's historic district...and created a holographic display encompassing a city block. She also conceived, built mathematical models of, resolved the fundamental engineering issues, and solved some of the logistics - to create what would have been the largest display ever for mankind: images displayed on the darkened moon. She co-created the first holographic video system in the world at the MIT Media Lab in 1989, where the interference structure of the hologram was computed at video rates, and shown on her hand-made display. This system inspired a new subfield of holographic video and received numerous awards.",
      "website":"http://en.wikipedia.org/wiki/Mary_Lou_Jepsen",
      "image_path":"/img/profile/220px-Mary_Lou_Jepsen_-_eTech_2009.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Mary_Lou_Jepsen",
      "birth_year":"1964",
      "given_name":"Mary Lou",
      "surname":"Jepsen",
      "known_for":"Co-founder, One Laptop Per Child",
      "alma_mater":"Brown University"
   },
   {
      "id":"49",
      "name":"Mary Shaw",
      "details":"Mary Shaw is an American software engineer, and the Alan J. Perlis Professor of Computer Science in the School of Computer Science at Carnegie Mellon University, Pittsburgh, United States. Shaw's main area of research interest is software engineering, including architectural, educational and historical aspects. Shaw authored seminal works in the field of software architecture along with David Garlan. In 2011, Shaw and Garlan received the Outstanding Research Award from ACM SIGSOFT, the Association of Computing Machinery's Special Interest Group on Software Engineering, for their \"significant and lasting software engineering research contributions through the development and promotion of software architecture.\" On October 3, 2014, U.S. President Barack Obama announced that Shaw was awarded the National Medal of Technology and Innovation.",
      "website":"http://en.wikipedia.org/wiki/Mary_Shaw_(computer_scientist)",
      "image_path":"/img/profile/Mary-Shaw.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Mary_Shaw_(computer_scientist)",
      "birth_year":"1943",
      "given_name":"Mary",
      "surname":"Shaw"
   },
   {
      "id":"50",
      "name":"Melanie",
      "details":"Melanie Rieback is a former Asst. Prof. of Computer Science at VU who performed RFID security research (RFID Virus and RFID Guardian), that got worldwide press coverage, and won several awards (VU Mediakomeet, ISOC Award finalist, NWO I/O award, IEEE Percom Best Paper, USENIX Lisa Best Paper). Melanie also worked as a Sr. Engineering Manager on XenClient at Citrix, where she led the Citrix Vancouver office. She was also a Sr. Managing Consultant in the Cyber Crime Expertise and Response Team (CCERT) at ING Bank, where she set up the CCERT Analysis Lab and was the lead technical project manager of the ING Core Threat Intelligence Systems. For fun, she founded the Dutch Girl Geek Dinner in 2008. Melanie was also named 2010 ICT Professional of the Year (Finalist) by WomeninIT, and one of the \"400 most successful women in the Netherlands\" by Viva Magazine (Viva400) in 2010.",
      "website":"http://www.cs.vu.nl/~melanie/",
      "image_path":"/img/profile/melanie2.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Melanie",
      "surname":"Rieback"
   },
   {
      "id":"51",
      "name":"Monica S. Lam",
      "details":"Monica Sin-Ling Lam is a professor in the Computer Science Department at Stanford, and Founder of MokaFive. Monica S. Lam receives a Ph.D. for her work on optimising compilers. She has since then performed influential research in many areas of computer science as well as co-authored a famous textbook on compilers. Monica Lam received a B.Sc. from University of British Columbia in 1980 and a Ph.D. in Computer Science from Carnegie Mellon University in 1987. Lam joined the faculty of Computer Science at Stanford University in 1988. She currently directs the Mobisocial laboratory at Stanford. She has contributed to the research of a wide range of computer systems topics including compilers, program analysis, operating systems, security, computer architecture, and high-performance computing. Lam chaired the ACM SIGPLAN Programming Languages Design and Implementation Conference in 2000, served on the Editorial Board of ACM Transactions on Computer Systems and numerous program committees for conferences on languages and compilers (PLDI, POPL), operating systems (SOSP), and computer architecture (ASPLOS, ISCA).",
      "website":"http://en.wikipedia.org/wiki/Monica_S._Lam",
      "image_path":"/img/profile/monica-s-lam.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Monica_S._Lam",
      "given_name":"Monica",
      "surname":"Lam"
   },
   {
      "id":"52",
      "name":"Phyllis Fox",
      "details":"Phyllis Fox (born 1934) is an American mathematician and computer scientist. Phyllis Fox worked on the PORT portable mathematical/numerical library. Fox was part of the team that wrote DYNAMO for Jay Forrester's system dynamics research group. She then became a collaborator on the first LISP interpreter, and the principal author of the first LISP manual. After a stint as a tenured professor, she moved to Bell Labs to work on a highly portable numerics library (PORT).",
      "website":"http://en.wikipedia.org/wiki/Phyllis_Fox",
      "image_path":"/img/profile/Phyllis-Fox-by-Tom-Haigh.gif",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Phyllis_Fox",
      "birth_year":"1934",
      "given_name":"Phyllis",
      "surname":"Fox"
   },
   {
      "id":"53",
      "name":"Radia Perlman",
      "details":"Radia Perlman invented the Spanning Tree Protocol. She has done extensive and innovative research particularly on encryption and networking. She received the USENIX Lifetime Achievement Award in 2007 among numerous others. She is most famous for her invention of the spanning-tree protocol (STP), which is fundamental to the operation of network bridges, while working for Digital Equipment Corporation. She also made large contributions to many other areas of network design and standardization, such as link-state protocols, including TRILL, which she invented to correct some of the shortcomings of spanning-trees. She is sometimes referred to as the \"Mother of the Internet\", a title which she dislikes. Her work transformed the Ethernet protocol from using a few nodes over a limited distance, into something able to create large networks.Perlman is the author of one textbook on networking and coauthor of one textbook on network security. She holds more than 100 issued patents.\n",
      "website":"http://en.wikipedia.org/wiki/Radia_Perlman",
      "image_path":"/img/profile/220px-Radia_Perlman_2009.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Radia_Perlman",
      "birth_year":"1951",
      "given_name":"Radia",
      "surname":"Perlman",
      "known_for":"Network and security protocols; computer books",
      "alma_mater":"Massachusetts Institute of Technology"
   },
   {
      "id":"54",
      "name":"Rana el Kaliouby",
      "details":"Rana el Kaliouby, Ph.D (born 1978) is the inventor of expression-recognition technology, which is a subset of facial recognition. Expression recognition goes beyond identifying faces, and delves into physical indicators of how someone is feeling. Although, El Kaliouby was not the first to study expression recognition, her research is significant because it avoids the exaggerated obvious expressions created in the laboratory, and focuses more on the realistic and subtle glances that people often make.",
      "website":"http://en.wikipedia.org/wiki/Rana_el_Kaliouby",
      "image_path":"/img/profile/Rana_el_Kaliouby.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Rana_el_Kaliouby",
      "birth_year":"1978",
      "given_name":"Rana",
      "surname":"El Kaliouby"
   },
   {
      "id":"55",
      "name":"Rósa Péter",
      "details":"Rózsa Péter, born Politzer was a Hungarian mathematician. She is best known for her work with recursion theory. Initially, Péter began her graduate research on number theory. Upon discovering that her results had already been proven by the work of Robert Carmichael and L. E. Dickson, she abandoned mathematics to focus on poetry. However, she was convinced to return to mathematics by her friend, László Kalmár, who suggested she research the work of Kurt Gödel on the theory of incompleteness. She prepared her own, different proofs to Gödel's work. Péter presented the results of her paper on recursive theory, \"Rekursive Funktionen,\" to the International Congress of Mathematicians in Zurich, Switzerland in 1932. For her research, she received her PhD summa cum laude in 1935. In 1936, she presented a paper entitled \"Über rekursive Funktionen der zweite Stufe\" to the International Congress of Mathematicians in Oslo. These papers helped to found the modern field of recursive function theory as a separate area of mathematical research. In 1937, she was appointed as contributing editor of the Journal of Symbolic Logic. After the passage of the Jewish Laws of 1939 in Hungary, Péter was forbidden to teach because of her Jewish origin and was briefly confined to a ghetto in Budapest. During World War II, she wrote her book Playing with Infinity: Mathematical Explorations and Excursions, a work for lay readers on the topics of number theory and logic. Originally published in Hungarian, it has been translated into English and at least a dozen other languages. With the end of the war in 1945, Péter received her first full-time teaching appointment at the Budapest Teachers’ Training College. In 1952, she was the first Hungarian woman to be made an Academic Doctor of Mathematics. After the College closed in 1955, she taught at Eötvös Loránd University until her retirement in 1975. She was a popular professor, know as \"Aunt Rózsa\" to her students. In 1951, she published her key work, Recursive Functions (Rekursive Funtionen). She continued to publish important papers on recursive theory throughout her life. In 1959 she presented a major paper \"Über die Verallgemeinerung der Theorie der rekursiven Funktionen für abstrakte Mengen geeigneter Struktur als Definitionsbereiche\" to the International Symposium in Warsaw (later published in two parts in 1961 and 1962). Beginning in the mid-1950s, Péter applied recursive function theory to computers. Her final book, published in 1976, was Recursive Functions in Computer Theory. Originally published in Hungarian, it was translated into English in 1981.",
      "website":"http://www-groups.dcs.st-and.ac.uk/~history/Mathematicians/Peter.html",
      "image_path":"/img/profile/pr2c.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Rósa",
      "surname":"Péter"
   },
   {
      "id":"56",
      "name":"Rebecca Enonchong",
      "details":"Rebecca Enonchong is a Cameroonian born technology entrepreneur and also the founder and CEO of AppsTech. She is best known for her work promoting technology in Africa. Enonchong has been a recipient of various awards from organizations such as the World Economic Forum. Forbes listed her as one of the 10 Female Tech Founders To Watch In Africa during 2014. After finishing her education, Enonchong went onto work for a number of organizations including Inter-American Development Bank (IaDB) and Oracle Corporation.vIn 1999, Enonchong founded the company AppsTech, a Bethesda, Maryland-based global provider of enterprise application solutions. AppsTech is an Oracle Platinum Partner and has customers in over 40 countries. AppsTech opened offices in several countries, including Enonchong’s native Cameroon. She describes the experience as having been difficult and having led to the closure of AppsTech subsidiaries. In 2002, The World Economic Forum of Davos, Switzerland named Enonchong a Global Leader for Tomorrow (GLT) along with other tech entrepreneurs such as Google co-founder Larry Page and Salesforce.com CEO Marc Benioff. In 2013, Enonchong was recognized as a finalist for the African digital woman award. In March 2014, Forbes listed her as one of the ‘10 Female Tech Founders to Watch in Africa’. Enonchong has also gained notoriety as one of the more followed sources for African tech news on Twitter, with over 30 thousand followers. Her handle, @Africatechie, has become a nickname for Enonchong in IT circles.",
      "website":"http://en.wikipedia.org/wiki/Rebecca_Enonchong",
      "image_path":"/img/profile/27Mafrica_Enonchong_primary.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Rebecca_Enonchong",
      "birth_year":"1967",
      "given_name":"Rebecca",
      "surname":"Enonchong"
   },
   {
      "id":"57",
      "name":"Roberta Williams",
      "details":"Roberta Williams is an American video game designer, writer and a co-founder of Sierra On-Line (later known as Sierra Entertainment), who developed her first game while living in Simi Valley, California. She is most famous for her pioneering work in the field of graphic adventure games with titles such as Mystery House, the King's Quest series, and Phantasmagoria. She is married to Ken Williams and retired from her career in 1999. Roberta Williams is considered one of the most influential PC game designers of the eighties and nineties, and has been credited with creating the graphic adventure genre. In the 1980s and 1990s, Roberta and her husband, Ken Williams, were leading figures in the development of graphical adventure games. In 1980, they founded the company On-Line Systems, which later became Sierra On-Line. The first Williams' title was Mystery House (1980), which became known as the first graphical adventure game. The second title, Wizard and the Princess (1980), added color graphics. But the first serious success was the King's Quest series, which featured a \"large expansive world\" that could be explored by players. After that, Roberta Williams designed such titles as Mixed-Up Mother Goose (1987), The Colonel's Bequest (1989), and Phantasmagoria (1995), which was the first in her career to be developed in the full-motion video technology. Phantasmagoria featured extreme violence and rape scenes. The game has received mixed reviews. Though Sierra was sold in 1996, Williams' production credits date to 1999, when she retired from Sierra On-Line. Roberta posed for the cover of the game Softporn Adventure by Chuck Benton, published by On-line Systems. She also posed much later with her children as Mother Goose for the cover photograph of Mixed-Up Mother Goose. The end sequence of Leisure Suit Larry 3 features her as an in-game character. In a 2006 interview, Williams said that designing computer games was in the past for her then and that she intended to write a historical novel. However, in 2011, the video game website Gamezebo reported that Roberta Williams was working on a social network game Odd Manor.",
      "website":"http://en.wikipedia.org/wiki/Roberta_Williams",
      "image_path":"/img/profile/RobertaWilliams.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Roberta_Williams",
      "birth_year":"1953",
      "given_name":"Roberta",
      "surname":"Williams"
   },
   {
      "id":"58",
      "name":"Ruchi Sanghvi",
      "details":"Ruchi Sanghvi (born January 20, 1982) is an Indian computer engineer. She was the first female engineer hired by the social-networking website Facebook. Sanghvi was the Principal Product Manager at Facebook, where she oversaw Facebook Platform and News Feed. She was responsible for the company’s Platform product strategy and new product initiatives. Sanghvi was an early engineer at Facebook and one of the primary developers for News Feed. Prior to Facebook, she was a software engineer in the Real Time Communication Group at Oracle. Sanghvi holds a bachelor’s and master’s degree in electrical computer engineering from Carnegie Mellon University. In late 2010, she quit Facebook and in 2011, she started her own company Cove, with two other co-founders. The company was sold to Dropbox in 2012 and Sanghvi joined Dropbox. She left Dropbox in October 2013.",
      "website":"http://en.wikipedia.org/wiki/Ruchi_Sanghvi",
      "image_path":"/img/profile/Ruchi_Sanghvi.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Ruchi_Sanghvi",
      "birth_year":"1982",
      "given_name":"Ruchi",
      "surname":"Sanghvi"
   },
   {
      "id":"59",
      "name":"Ruth Lichterman",
      "details":"Ruth Teitelbaum was one of the original programmers for the ENIAC computer. Teitelbaum graduated from Hunter College with a B.Sc. in Mathematics. She was hired by the Moore School of Engineering to compute ballistics trajectories and was later selected as one of the first programmers for the ENIAC, which was developed to perform the same calculations. Along with Maryln Meltzer, Teitelbaum was part of a special area of the ENIAC project. Using analog technology, they calculated ballistic trajectory equations. Although a pivotal role in the rise of computers, she was given little credit toward the foundations of the ENIAC. She travelled with ENIAC to the Ballistics Research Laboratory at the Aberdeen Proving Grounds where she remained for two more years to train the next group of ENIAC programmers. She died in Dallas, Texas in 1986. In 1997 she was inducted into the Women in Technology International Hall of Fame, along with the other original ENIAC programmers.\n",
      "website":"http://en.wikipedia.org/wiki/Ruth_Teitelbaum",
      "image_path":"/img/profile/eniac_5.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Ruth_Teitelbaum",
      "birth_year":"1924",
      "death_year":"1986",
      "given_name":"Ruth",
      "surname":"Teitelbaum"
   },
   {
      "id":"60",
      "name":"Sally Floyd",
      "details":"Sally Floyd was a computer scientist at the International Computer Science Institute in Berkeley, California. She retired in 2009. She is best known for her work on Internet congestion control, and is one of the top-ten most cited researchers in computer science. Dr. Floyd received a BA in Sociology from the University of California - Berkeley in 1971. She received an MS in Computer Science in 1984 and a PhD in 1987, both from UC - Berkeley. Floyd is best known in the field of congestion control as the inventor of Random Early Detection (\"RED\") active queue management scheme, thus founding the field of Active Queue Management (AQM) with Van Jacobson. Almost all Internet routers use RED or something developed from it to develop data paths between different networks. Floyd devised the now-common method of adding jitter to message timers to avoid synchronization. Floyd, with Vern Paxson, in 1997 identified the lack of knowledge of network topology as the major obstacle in understanding how the Internet works. This paper, \"Why We Don't Know How to Simulate the Internet\", was re-published as \"Difficulties in Simulating the Internet\" in 2001 and won the IEEE Communication Society's William R. Bennett Prize Paper Award. Floyd is also a co-author on the standard for TCP Selective acknowledgement (SACK), Explicit Congestion Notification (ECN), the Datagram Congestion Control Protocol (DCCP) and TCP Friendly Rate Control (TFRC). She received the IEEE Internet Award in 2005 and the ACM SIGCOMM Award in 2007 for her contributions to congestion control. She has been involved in the Internet Advisory Board, and is one of the top-ten most cited researchers in computer science.",
      "website":"http://en.wikipedia.org/wiki/Sally_Floyd",
      "image_path":"/img/profile/sally-floyd.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Sally_Floyd",
      "given_name":"Sally",
      "surname":"Floyd"
   },
   {
      "id":"61",
      "name":"Sandra Kurtzig",
      "details":"Sandra Kurtzig is an American businesswoman and technology entrepreneur. She was one of Silicon Valley's first female entrepreneurs, and as the founder of the business and manufacturing software producer ASK Group in 1972, was the first woman to take a Silicon Valley technology company public. Kurtzig earned a Bachelor's degree in mathematics from University of California, Los Angeles, and a Master's degree in aeronautical engineering at Stanford University. In 1972, she quit her job selling computer time-sharing for General Electric and devoted more of her time to starting a family. She founded ASK Group as a part-time job, using $2,000 of her own savings. Kurtzig wasn't able to give up working completely and launched a small, part-time contract software-programming business out of her second bedroom \"to keep her mind occupied\" and increase her income, never intending the business to operate outside her house. She was asked to create an inventory-tracking program that could efficiently provide manufacturing information by her first client. Realizing that other manufacturers might find such a program useful, she recruited several graduates with degrees in engineering and computers. They wrote standardized applications that addressed problems faced by local manufacturers under her direction. Initially, the start-up received no interest from venture capitalists, so she instead launched ASK Group on her retained earnings. Her company required access to minicomputers and she persuaded employees at a nearby Hewlett-Packard plant to allow her company to use one of the company's HP 3000 minicomputers outside of normal working hours. By 1978, ASK released a package of programs called Manman, one of the first enterprise resource planning (ERP) software suites. She later concluded a deal for Hewlett Packard to sell Manman for use on HP3000 minicomputers, at a time when most ERP software was only available to run on more expensive mainframe computers. The company went public on NASDAQ in 1981, and in 1983, Kurtzig's personal stake in the ASK Group was worth $67 million. At its peak, the company's annual sales revenue was 450 million US dollars. She resigned from her role CEO of ASK Group in 1985. In 2010 she founded the enterprise management software company Kenandy, where she is currently the chairman and CEO. Kenandy is named after Kurtzig's sons, Ken and Andy, who are serving as CEOs at other tech businesses. In June 2013, Kenandy announced a $33 million round of funding led by Lightspeed Venture Partners. Kurtzig's autobiography, CEO: Building a $400 Million Company from the Ground Up was published by Harvard Business Press.",
      "website":"http://en.wikipedia.org/wiki/Sandra_Kurtzig",
      "image_path":"/img/profile/kurtzig.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Sandra_Kurtzig",
      "given_name":"Sandra",
      "surname":"Kurtzig"
   },
   {
      "id":"62",
      "name":"Shafi Goldwasser",
      "details":"Shafrira Goldwasser is an American-born Israeli computer scientist. She is a professor of electrical engineering and computer science at MIT, and a professor of mathematical sciences at the Weizmann Institute of Science, Israel. Born in New York City, Goldwasser obtained her B.S. (1979) in mathematics and science from Carnegie Mellon University, and M.S. (1981) and PhD (1984) in computer science from the University of California, Berkeley under the supervision of Manuel Blum, who is well known for advising some of the most prominent researchers in the field. She joined MIT in 1983, and in 1997 became the first holder of the RSA Professorship. She became a professor at the Weizmann Institute of Science, concurrent to her professorship at MIT, in 1993. She is a member of the Theory of Computation group at MIT Computer Science and Artificial Intelligence Laboratory. Goldwasser was a co-recipient of the 2012 Turing Award. Goldwasser's research areas include computational complexity theory, cryptography and computational number theory. She is the co-inventor of zero-knowledge proofs, which probabilistically and interactively demonstrate the validity of an assertion without conveying any additional knowledge, and are a key tool in the design of cryptographic protocols. Her work in complexity theory includes the classification of approximation problems, showing that some problems in NP remain hard even when only an approximate solution is needed.",
      "website":"http://en.wikipedia.org/wiki/Shafi_Goldwasser",
      "image_path":"/img/profile/220px-Shafi_Goldwasser.JPG",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Shafi_Goldwasser",
      "birth_year":"1958",
      "given_name":"Shafi",
      "surname":"Goldwasser",
      "known_for":"Goldwasser–Micali cryptosystem; Blum–Goldwasser cryptosystem;",
      "alma_mater":"University of California, Berkeley;Carnegie Mellon University"
   },
   {
      "id":"63",
      "name":"Sister Mary Kenneth Keller",
      "details":"Sister Mary Kenneth Keller was the first American woman to earn a PhD in Computer Science, which she earned in 1965 at the University of Wisconsin–Madison. Her thesis was titled \"Inductive Inference on Computer Generated Patterns.\" She took her vows with the Sisters of Charity in 1940. Later she earned a B.S. in Mathematics and a M.S. in Mathematics and Physics from DePaul University. She also worked in the computer science center at Dartmouth College, a men-only institution at the time, where she joined John G. Kemeny and Thomas E. Kurtz to create the BASIC programming language. Keller believed in the potential for computers to increase access to information and promote education. In 1965, after earning her PhD, Keller founded the computer science department at Clarke College in Iowa, which she directed for twenty years. Clarke College now has the Keller Computer Center and Information Services, which is named after her and which provides computing and telecommunication support to Clarke College students, faculty members, and staff. The college has also established the Mary Kenneth Keller Computer Science Scholarship in her honor. Keller wrote four books about computer science.",
      "website":"http://en.wikipedia.org/wiki/Mary_Kenneth_Keller",
      "image_path":"/img/profile/mary_keller.png",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Mary_Kenneth_Keller",
      "birth_year":"1913",
      "death_year":"1985",
      "given_name":"Mary Kenneth",
      "surname":"Keller",
      "known_for":"BASIC",
      "alma_mater":"University of Wisconsin–Madison; DePaul University"
   },
   {
      "id":"64",
      "name":"Sophie Wilson",
      "details":"Sophie Wilson FRS (born Roger Wilson in Leeds, England, in 1957) is a British computer scientist. She is known for designing the Acorn Micro-Computer, the first of a long line of computers sold by Acorn Computers Ltd, as well as the instruction set of the ARM processor. Wilson studied computer science and the Cambridge Mathematical Tripos at the University of Cambridge. In 1978, she designed the Acorn Micro-Computer, the first of a long line of computers sold by Acorn Computers Ltd. In 1981, Wilson extended the Acorn Atom's BASIC programming language dialect into an improved version for the Acorn Proton, a microcomputer that enabled Acorn to win the contract with the British Broadcasting Corporation (BBC) for their ambitious computer education project, whereupon the Proton became the BBC Micro and its BASIC was developed into BBC BASIC. In 1983, she designed the instruction set for one of the first RISC processors, the Acorn RISC Machine (ARM), later to become one of the most successful IP cores (i.e., a licenced CPU core) of the 1990s and 2000s. Wilson designed Acorn Replay, the video architecture for Acorn machines. This included the operating system extensions for video access as well as the codecs themselves, optimised to run high frame rate video on ARM CPUs from the ARM 2 onwards. Wilson was a member of the board of the technology and games company Eidos plc, which bought and created Eidos Interactive, for the years following its flotation in 1990, and was a consultant to ARM Ltd when it was split off from Acorn in 1990. Since the demise of Acorn Computers, Wilson has made a small number of public appearances to talk about her time there. Wilson is now the Director of IC Design in Broadcom’s Cambridge, UK office. She was the Chief Architect of Broadcom's Firepath processor. Firepath has its history in Acorn Computers, which, after being renamed to Element 14, was bought by Broadcom in 2000. She was listed in 2011 in Maximum PC as number 8 in an article entitled The 15 Most Important Women in Tech History. She was awarded the Fellow Award by the Computer History Museum in California in 2012. In 2013 Sophie was elected as a Fellow of the prestigious Royal Society.",
      "website":"http://en.wikipedia.org/wiki/Sophie_Wilson",
      "image_path":"/img/profile/sw_1.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Sophie_Wilson",
      "birth_year":"1957",
      "given_name":"Sophie",
      "surname":"Wilson",
      "known_for":"Acorn Computers; BBC Micro; BBC BASIC; ARM architecture",
      "alma_mater":"University of Cambridge"
   },
   {
      "id":"65",
      "name":"Susan Estrada",
      "details":"Estrada founded CERFnet, one of the original regional IP networks, in 1988. CERFnet served the academic and commercial communities in California. As executive director, she took the initial National Science Foundation funding of $2.8 million and grew the network from 25 sites to hundreds of sites. CERFnet was a particularly visible network because of Estrada’s success in using a small amount of resources to achieve early commercial acceptance of the Internet. CERFnet developed a number of notable firsts for the Internet, including the first deployment of dialup IP, accounting reports for customers, and high quality service with 24/7 monitoring. Through her leadership and collaboration with PSInet and UUnet, Estrada helped form the interconnection enabling the first commercial Internet traffic via the Commercial Internet Exchange. Estrada was the recipient of the Interop Achievement Award in 1991. She wrote Connecting to the Internet, An O’Reilly Buyer’s Guide, a Barnes and Noble bestseller, in 1993. In it, she gives practical advice on how to get the best Internet service. She maintains a deep interest in emerging Internet technologies and making those technologies work to solve real-world problems. As an entrepreneur running Aldea Communications for over 20 years, Estrada continues to consult on Internet infrastructure and to investigate technologies and techniques needed to increase older-adult use of the Internet.",
      "website":"http://internethalloffame.org/inductees/susan-estrada",
      "image_path":"/img/profile/Susan_Estrada.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Susan",
      "surname":"Estrada"
   },
   {
      "id":"66",
      "name":"Susan Hares",
      "details":"An internationally recognized leader in commercialized advanced networking technologies and products, she has more than 30 years of experience in designing and deploying routing protocols and architectures. She earned a Bachelor of Science degree in Computer Engineering from the University of Michigan, and a Masters of Organizational Leadership from Regent University Business School, where she is currently in the Ph.D. Program. She led the technology qualification, development, and strategic planning functions at NextHop Technologies. Prior to launching NextHop Technologies, she spent 13 years at Merit Network Inc. where she most recently directed the Merit GateD Consortium. She was also a Senior Engineer at both Allen- Bradley Corp. and ADP Inc. She then served as the Senior Director in the United States at Huawei Technologies, IPBU's Standards for the Network Product Line. During her tenure, she led a multi-national team of Internet researchers pushing the boundaries of Internet technology in optical, edge of the network SDN, and data center technology. She was previously Director of Networking Solutions at Green Hills Software, where she guided a team to put routing software on a secure OS, and created the basis for a secure data center switch with multiple chassis. She co-chairs the Internet Engineering Task Force’ s (IETF's) inter-domain routing group that is standardizing border gateway protocol. She is also a member of the NANOG (North American Network Operators' Group) steering committee. In 2013, she joined ADARA Networks as Vice President of Technology and Strategy, where she is responsible for direction of ADARA's industry-leading software defined networking technology and strategy, participation and contribution to defining SDN standards and collaborating with service providers and technology vendors in the advancement of OpenFlow, Interface to the Routing System (I2RS), Network Functions Virtualization (NVF) and other emerging SDN and virtualization technologies. She is co-author on the BGP specification; used to make the core routing decisions on the Internet, BGP is considered industry-wide to be the most important protocol of the Internet. ",
      "website":"http://www.ithistory.org/honor_roll/fame-detail.php?recordID=1531",
      "image_path":"/img/profile/Susan-Hares.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Susan",
      "surname":"Hares"
   },
   {
      "id":"67",
      "name":"Susan Kare",
      "details":"Susan Kare (born 1954) is an artist and graphic designer who created many of the interface elements for the Apple Macintosh in the 1980s. She was also one of the original employees of NeXT (the company formed by Steve Jobs after leaving Apple in 1985), working as the Creative Director. Kare was born in Ithaca, New York, and is the sister of aerospace engineer Jordin Kare. She graduated from Harriton High School in 1971, received her B.A., summa cum laude, in Art from Mount Holyoke College in 1975 and her Ph.D. from New York University in 1978. She next moved to San Francisco and worked for the Museum of Modern Art. Kare joined Apple Computer after receiving a call from high school friend Andy Hertzfeld in the early 1980s. A member of the original Apple Macintosh design team, she worked at Apple Computer starting in 1982 (Badge #3978). Kare was originally hired into the Macintosh software group to design user interface graphics and fonts; her business cards read \"HI Macintosh Artist\". Later, she was a Creative Director in Apple Creative Services working for the Director of that organization, Tom Suiter. After leaving Apple, Kare joined NeXT as a designer, working with clients such as Microsoft and IBM. Her projects for Microsoft included the card deck for Windows 3.0's solitaire game, as well as numerous icons and design elements for Windows 3.0. Many of her icons, such as those for Notepad and various Control Panels, remained essentially unchanged by Microsoft until Windows XP. For IBM she produced icons and design elements for OS/2; for Eazel she contributed iconography to the Nautilus file manager. The Museum of Modern Art store in New York City has begun carrying stationery and notebooks featuring her designs. Beginning February 7, 2007, she has produced icons for the \"Gifts\" feature of the popular social-networking website, Facebook. Initially, profits from gift sales were donated to the Susan G. Komen for the Cure foundation, for the fight against breast cancer. After Valentine's Day, the gift selection was modified to include new and limited edition gifts that did not necessarily pertain to Valentine's Day. One of the gift icons, titled \"Big Kiss\" is also featured in some versions of Mac OS X as a user account picture. In August 2012, she was called as an expert witness by Apple in the company's patent infringement trial against industry competitor Samsung. Kare currently heads a digital design practice in San Francisco and sells signed prints at kareprints.com.",
      "website":"http://en.wikipedia.org/wiki/Susan_Kare",
      "image_path":"/img/profile/susan-kare.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Susan_Kare",
      "birth_year":"1954",
      "given_name":"Susan",
      "surname":"Kare"
   },
   {
      "id":"68",
      "name":"Susan Nycum",
      "details":"Susan Nycum is a lawyer who specialises in computer security and intellectual property issues. She worked at the law firm of Chickering and Gregory in San Francisco and then became a partner at the law firm Baker & McKenzie where she headed its IT and intellectual property group. She was a fellow of the Association for Computing Machinery and a member of its council. She was an early member of its special interest group for higher education, SIGUCCS, and was inducted into its hall of fame in 2004. She was Chairwoman of the National Information Systems Advisory Panel in the early 1980s. Nycum earned a degree from Ohio Wesleyan University. She attended Duquesne University School of Law and graduated from Stanford Law School. Nycum has worked with fellow information security researcher Donn B. Parker. They co-authored the 1973 study Computer Abuse, a minor classic that was one of the first attempts to define and document computer-related crime. Nycum is a computer law scholar and has produced studies on the laws surrounding software patents. She has served as an advisor for the United States government as well as several foreign governments. She approved funding for the Internet in her role as an advisory board member for the National Science Foundation.",
      "website":"http://en.wikipedia.org/wiki/Susan_Nycum",
      "image_path":"/img/profile/susan.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Susan_Nycum",
      "given_name":"Susan H.",
      "surname":"Nycum"
   },
   {
      "id":"69",
      "name":"Thelma Estrin",
      "details":"Thelma Estrin, a 1977 IEEE Life Fellow \"for contributions to the design and application of computer systems for neurophysiological and brain research,\" is a pioneer in the field of biomedical engineering and as the IEEE's first female vice president. Thelma was born in New York City, an only child who was destined to attend college and attain greater achievements. While other girls in school took commercial courses, she pursued academic courses and prepared to go to college. She attended City College of New York (CCNY) in 1941 where she met her husband Gerald Estrin. A year later, in 1942, she took a three month course at Stevens Institute of Technology for engineering assistants. She worked for two years at the Radio Receptor Company. In 1946 she and Jerry moved to Madison, Wisconsin, to pursue undergraduate electrical engineering degrees at the University of Wisconsin. Through a great deal of hard work and long days, Thelma Estrin received her B.S., M.S. and Ph.D. in 1948, 1949 and 1951, respectively. Jerry received an offer to join John von Neumann's computer project at the Institute for Advanced Study and they moved to Princeton, NJ. Thelma was determined to maintain her own career and was hired at the Electroencephalography Department of the Neurological Institute of Columbia Presbyterian Hospital (New York) in November 1951. Thelma and Jerry spent fifteen months in Israel working on the WEIZAC (WEIZmann Automatic Computer). This became the first electronic computer in the Near East, and is now an IEEE Mielstone in Electrical and Computer Engineering (in the 1980s, the WEIZAC team was interviewed for the Computer Pioneers Project). In 1960, Thelma joined the Brain Research Institute (BRI) and in 1970 became the Director of its Data Processing Laboratory. As Director she provided computer support for a variety of research projects and helped dozens of researchers make use of computers. Thelma was an early champion of medical informatics, the application of computers to medical research and treatment, in all its branches. In 1980 Thelma became a professor in residence in the Computer Science Department of the School of Engineering and Applied Science at UCLA. She retired in July 1991 at the age of sixty-seven. Thelma has been an active IEEE volunteer, serving as an officer of the IEEE Engineering in Medicine and Biology Society and on the Technical Activities Board, and she was the first woman to be elected to the IEEE Board of Directors. In 1982 she served as executive vice president of IEEE. She has received many honors from the Institute, including the Haradan Pratt Award in 1991.",
      "website":"http://www.ieeeghn.org/wiki/index.php/Thelma_Estrin",
      "image_path":"/img/profile/180px-Thelma_Estrin_2608.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Thelma",
      "surname":"Estrin"
   },
   {
      "id":"70",
      "name":"Window Snyder",
      "details":"Mwende Window Snyder is a security and privacy product manager at Apple Inc. and the former Chief Security Something-Or-Other (a tongue-in-cheek Chief Security Officer title) at Mozilla Corporation. She is co-author of Threat Modeling, a standard manual on application security. Snyder is the daughter of an American father and a Kenyan-born mother, Wayua Muasa. Snyder was Director of Security Architecture at @stake and was a senior security strategist at Microsoft in the Security Engineering and Communications organization, most notably as security lead and signoff on Microsoft Windows XP Service Pack 2 and Windows Server 2003. After leaving Microsoft in 2005, she worked as a principal, founder, and CTO at Matasano Security. She joined Mozilla in September 2006. On 10 December 2008, Snyder reported in the Mozilla Security blog that she would be leaving Mozilla Corporation at the end of the year. On 1 March 2010, Snyder began work at Apple Inc.",
      "website":"http://en.wikipedia.org/wiki/Window_Snyder",
      "image_path":"/img/profile/Window-Snyder.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "dbpedia_uri":"http://dbpedia.org/resource/Window_Snyder",
      "birth_year":"1976",
      "given_name":"Window",
      "surname":"Snyder"
   },
   {
      "id":"71",
      "name":"Xiaoyuan Tu",
      "details":"Xiaoyuan Tu is a co-founder and lead scientist at AiLive Inc. (formerly iKuni Inc.), a Silicon Valley based start-up company focusing on AI effects for computer entertainment. She received her Ph.D degree (96') in Computer Science from the University of Toronto and the Honors M.Eng degree in Electrical and Computer Engineering from McMaster University. Her Honors B.Eng degree was in Control Theory and Automation from TsingHua University in China. Prior to co-founding AiLive, Dr. Tu was a research scientist in the Media and Graphics Research Lab at Intel Corp. from 1997 to 2000. During 1996 and 1997, she was a senior member of the technical staff at SGI. Dr. Tu has received many honors and awards for her technical contributions to the fields of computer animation, behavioral modeling and artificial life. In 1996 she received the prestigious ACM Doctoral Dissertation Award for her Ph.D dissertation \"Artificial Animals for Computer Animation: Biomechanics, Locomotion, Perception, and Behavior\". Although other women have won the runner-up Dissertation Award, Dr. Tu is the first (and currently only) woman to be awarded the first-place Dissertation Award. She also happens to be the first to win from a Canadian University and the first Chinese to receive this special honor. In 1994 she received the Technical Excellence Award from the Canadian Academy of Multimedia and Arts and from 1993 to 1995 her animation work was honored in numerous premier competetions for creative science with digital media, including the Siggraph Electronic Theatre, the Ars Electronica and the Computer Animation Film Festival. Dr. Tu's main research interests are in the modeling, control and simulation of life-like, intelligent virtual characters. Her research spans the areas of autonomous agent architecture design, physics and biomechanics-based modeling, machine learning, computer graphics animation and artificial life.",
      "website":"http://www.dgp.toronto.edu/~tu/",
      "image_path":"/img/profile/me.jpg",
      "image_width":"150",
      "tags":"Ada Lovelace Day,History of Computing,Women in Tech",
      "given_name":"Xiaoyuan",
      "surname":"Tu"
   }
],
    "published": "10/15/2014"

}